{
  "backend/main.mo": "Motoko canister defining data models, maps, and authorized CRUD/query logic for benches, documents, components, history, and user profiles.",
  "feature_evidence.json": "Machine-generated feature evidence report listing localization-related features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for many frontend source files used in build planning.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color tokens, theming variables, and dark-mode overrides.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React application entry defining routing trees, providers, protected layouts, and error boundaries.",
  "frontend/src/components/admin/AdminGate.tsx": "Guard component that checks admin status and shows i18n-based loading or access-denied messages.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that displays a user-friendly fallback UI with reload option when runtime errors occur.",
  "frontend/src/components/auth/ActorGate.tsx": "Component ensuring a backend actor is available, showing loading or error states before rendering children.",
  "frontend/src/components/auth/AuthGate.tsx": "Redirects unauthenticated users to sign‑in and shows loading or sign‑in prompts before rendering children.",
  "frontend/src/components/dnd/DraggableList.tsx": "Renders a draggable list with visual drag states and delegates reordering logic to parent callbacks.",
  "frontend/src/components/dnd/useDraggableOrder.ts": "Provides state and handlers for drag‑and‑drop list reordering, including drag tracking and item repositioning.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with navigation, theme toggle, user menu, and sign‑out handling.",
  "frontend/src/components/navigation/ScrollShortcuts.tsx": "Shows scroll‑to‑top and scroll‑to‑bottom buttons based on scroll position and performs smooth scrolling.",
  "frontend/src/components/profile/EntityTagInput.tsx": "Lets users enter or select a single entity tag with suggestions, keyboard handling, and validation UI.",
  "frontend/src/components/profile/PredefinedAvatarPicker.tsx": "Displays a grid of predefined avatars and lets the user pick one, highlighting the selected option.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user avatar from predefined or custom images with cache‑busting and size options.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Toggles the app’s light/dark theme using next‑themes.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAvatarCacheBuster.ts": "Zustand store providing a timestamp‑based cache‑buster for avatar URLs.",
  "frontend/src/hooks/useDashboardChartType.ts": "Stores and persists the dashboard chart type in localStorage with a simple setter.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, identity state, and status flags.",
  "frontend/src/hooks/useLastSeenHeartbeat.ts": "Sends periodic heartbeat updates to the backend using the authenticated actor, running every minute when identity is available.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as user profiles, test benches, roles, and expiration preferences.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides language state management, loading preferences from backend or local storage and allowing language updates.",
  "frontend/src/i18n/languages.ts": "Defines supported languages and helpers to validate or look up languages by code.",
  "frontend/src/i18n/translations.ts": "Exports a large union type listing all translation keys used throughout the application.",
  "frontend/src/i18n/useI18n.ts": "Offers a translation hook that resolves keys based on the current language and provides language management helpers.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines light and dark theme CSS variables for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Admin/AdminPage.tsx": "Renders the admin dashboard with tabs for benches, documents, and users, using translated labels.",
  "frontend/src/pages/Admin/components/AdminBenchesPanel.tsx": "Displays all test benches with loading state and supports deleting a selected bench via a confirmation dialog.",
  "frontend/src/pages/Admin/components/AdminDocumentsPanel.tsx": "Lists all documents with metadata and provides a download action with loading and error handling.",
  "frontend/src/pages/Admin/components/AdminUsersPanel.tsx": "Shows the current user's profile, expiration settings, and dashboard preferences with loading and empty states.",
  "frontend/src/pages/Benches/BenchDetailPage.tsx": "Shows detailed bench info, components, documents, history, and supports editing, removing, and duplicating components.",
  "frontend/src/pages/Benches/BenchListPage.tsx": "Displays searchable bench cards, handles loading and empty states, and allows opening the add‑bench modal.",
  "frontend/src/pages/Benches/components/AddBenchModal.tsx": "Form modal for creating a new bench, handling metadata inputs, photo upload, validation, tags, components, and duplication options.",
  "frontend/src/pages/Benches/components/BenchComponentsTableEditor.tsx": "Editor table for adding, editing, removing, and duplicating bench components with status calculation.",
  "frontend/src/pages/Benches/components/BenchDocumentsEditor.tsx": "Manages bench documents by uploading, associating, versioning, and deleting files grouped by category.",
  "frontend/src/pages/Benches/components/BenchHistoryList.tsx": "Displays a sorted list of bench history entries with user info and timestamps.",
  "frontend/src/pages/Benches/components/BenchPhoto.tsx": "Renders a bench photo with loading and error fallback handling.",
  "frontend/src/pages/Benches/components/DocumentCategoriesInput.tsx": "Input component for managing document categories and their associated uploaded files and versions.",
  "frontend/src/pages/Benches/components/DuplicateComponentDialog.tsx": "Dialog for selecting benches and duplicating a component to them using mutation hooks, with validation and success/error toasts.",
  "frontend/src/pages/Benches/components/EditBenchModal.tsx": "Modal for editing bench details, handling form validation, photo uploads, and updating the bench via a mutation.",
  "frontend/src/pages/Benches/components/TagsInput.tsx": "Tag input component allowing adding, removing, and selecting from suggested tags with filtering and keyboard support.",
  "frontend/src/pages/Benches/NewBenchPage.tsx": "Placeholder page describing upcoming bench creation features with a coming‑soon notice.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ComponentsByStatusPieCard.tsx": "Pie chart card summarizing component expiration statuses across benches using threshold logic and i18n.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/CriticalityChartCard.tsx": "Bar chart showing counts of components by expiration status per bench, dynamically labeled with i18n.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DeadlineChartCard.tsx": "Bar chart grouping components by expiration date ranges and displaying counts per range.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DocumentsByCategoryPieCard.tsx": "Pie chart displaying distribution of documents by category with color-coded segments.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpirationTrendChartCard.tsx": "Builds a monthly expiration count dataset from component dates and renders it as a bar or line chart.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpiredByBenchChartCard.tsx": "Computes expired component counts per bench using threshold rules and displays them in a bar or line chart.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/HealthGaugeCard.tsx": "Calculates overall component health percentages and shows them as progress bars.",
  "frontend/src/pages/Dashboard/components/StatisticsSection.tsx": "Defines and orders statistic and chart cards for the dashboard, including draggable layout support.",
  "frontend/src/pages/DashboardPage.tsx": "Loads bench, component, and document data to render the main dashboard with charts, stats, and reorderable sections.",
  "frontend/src/pages/ProfilePage.tsx": "Manages user profile editing including identity, thresholds, avatars, language, and validation.",
  "frontend/src/pages/SignInPage.tsx": "Sign‑in page that triggers Internet Identity login, shows errors, and redirects authenticated users.",
  "frontend/src/utils/avatars.ts": "Defines a map of avatar IDs to image paths and provides helpers to fetch avatar paths and IDs.",
  "frontend/src/utils/blobUpload.ts": "Converts uploaded files into ExternalBlob objects with optional upload progress tracking.",
  "frontend/src/utils/defaultBenchPhoto.ts": "Loads a default bench placeholder image and converts it into an ExternalBlob.",
  "frontend/src/utils/download.ts": "Downloads an ExternalBlob as a file by creating a temporary blob URL and triggering a browser download.",
  "frontend/src/utils/errors.ts": "Normalizes various error types into readable messages with sensible fallbacks.",
  "frontend/src/utils/expirationSettings.ts": "Manages expiration threshold settings using local storage and user profile data, and computes expiration statuses.",
  "frontend/src/utils/id.ts": "Generates simple unique IDs using timestamps and random strings.",
  "frontend/src/utils/rewriteDescription.ts": "Applies deterministic text cleanup and formatting to bench descriptions, including capitalization and abbreviation normalization.",
  "frontend/src/utils/search.ts": "Searches test benches by matching query terms against name, code, description, and tags.",
  "frontend/src/utils/urlParams.ts": "Reads, stores, and persists URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/src/utils/validation.ts": "Validates email, domain‑specific email, AGILE codes, semantic versions, and URLs.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for typography, container queries, and animations.",
  "frontend/tsconfig.node.json": "TypeScript config for Node‑side tooling with ESNext modules and Vite config inclusion.",
  "frontend/vite.config.ts": "Vite config enabling React, environment variable injection, path aliases, API proxying, and build settings.",
  "project_state.json": "Stores project metadata, known i18n issues, and feature requests for localizing the Admin area and Bench history view. Includes existing features, pending requests, and project configuration details."
}