{
  "backend/main.mo": "Defines actor with access control, storage mixins, domain models for benches, documents, components, users, and query methods for retrieving test benches.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries for various frontend files describing components, pages, hooks, and utilities.",
  "frontend/index.css": "Tailwind base setup defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with authenticated routes, theme provider, and global error boundary.",
  "frontend/src/components/admin/AdminGate.tsx": "Empty placeholder file for an admin permission gate.",
  "frontend/src/components/AppErrorBoundary.tsx": "React class component catching rendering errors and showing a reload option.",
  "frontend/src/components/auth/ActorGate.tsx": "Gate component that waits for backend actor initialization and shows errors if unavailable.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication guard that blocks access until Internet Identity is loaded and valid.",
  "frontend/src/components/dnd/DraggableList.tsx": "Generic draggable list component supporting drag-and-drop reordering with visual cues.",
  "frontend/src/components/dnd/useDraggableOrder.ts": "React hook managing drag state and ordered list updates for draggable items.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout with header navigation, theme toggle, logout handling, and outlet rendering.",
  "frontend/src/components/navigation/ScrollShortcuts.tsx": "Shows scroll-to-top and scroll-to-bottom shortcut buttons based on scroll position.",
  "frontend/src/components/profile/PredefinedAvatarPicker.tsx": "Grid picker for predefined avatar images, highlighting the selected option.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user avatar from predefined or custom sources with size options and fallback icon.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating queries when it changes.",
  "frontend/src/hooks/useDashboardChartType.ts": "Stores and persists the user's preferred dashboard chart type using localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login/logout handling, and identity persistence.",
  "frontend/src/hooks/useLastSeenHeartbeat.ts": "Periodically updates the user's last-seen timestamp using the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data such as benches, profiles, and roles.",
  "frontend/src/index.css": "Tailwind base styles plus theme variables for light and dark mode.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/Admin/AdminPage.tsx": "Empty admin page placeholder.",
  "frontend/src/pages/Admin/components/AdminBenchesPanel.tsx": "Empty placeholder for an admin benches management panel.",
  "frontend/src/pages/Admin/components/AdminDocumentsPanel.tsx": "Empty placeholder for an admin documents management panel.",
  "frontend/src/pages/Admin/components/AdminUsersPanel.tsx": "Empty placeholder for an admin users management panel.",
  "frontend/src/pages/Benches/BenchDetailPage.tsx": "Detail view for a single bench, showing components, documents, history, and allowing edits or deletion.",
  "frontend/src/pages/Benches/BenchListPage.tsx": "Lists all benches with search, filtering, photo previews, and navigation to detail pages.",
  "frontend/src/pages/Benches/components/AddBenchModal.tsx": "Modal for creating a new bench with fields for metadata, photo upload, documents, tags, and components.",
  "frontend/src/pages/Benches/components/BenchComponentsTableEditor.tsx": "Table editor to add, edit, and remove bench components with expiration status calculation.",
  "frontend/src/pages/Benches/components/BenchDocumentsEditor.tsx": "Manages bench documents including upload, download, categorization, and deletion.",
  "frontend/src/pages/Benches/components/BenchHistoryList.tsx": "Displays a list of bench history entries sorted by timestamp, rendering each entry with user info, timestamp, and details.",
  "frontend/src/pages/Benches/components/BenchPhoto.tsx": "Renders a bench photo with loading and error handling, falling back to a placeholder on failure.",
  "frontend/src/pages/Benches/components/DocumentCategoriesInput.tsx": "Manages editable document categories, allowing adding/removing categories and uploading files with version metadata.",
  "frontend/src/pages/Benches/components/EditBenchModal.tsx": "Provides a modal form for editing bench details, validating inputs, updating photos, and submitting changes.",
  "frontend/src/pages/Benches/components/TagsInput.tsx": "Lets users add, remove, and select tags with autocomplete suggestions and keyboard support.",
  "frontend/src/pages/Benches/NewBenchPage.tsx": "Placeholder page describing planned features for creating a new bench.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ComponentsByStatusPieCard.tsx": "Generates a pie chart summarizing component health statuses across benches using expiration logic.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/CriticalityChartCard.tsx": "Displays a filterable bar chart counting components by criticality status across benches.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DeadlineChartCard.tsx": "Computes expiration buckets for components based on selected bench and time range, rendering a bar chart of counts.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DocumentsByCategoryPieCard.tsx": "Counts documents by category and displays the distribution in a pie chart with fallback for empty data.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpirationTrendChartCard.tsx": "Aggregates component expirations per month and shows the last 12 months in either a bar or line chart.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpiredByBenchChartCard.tsx": "Calculates expired components per bench and displays the top ten in a bar or line chart with an empty state.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/HealthGaugeCard.tsx": "Computes overall health percentages for components (OK, expiring soon, expired) and displays them with progress bars.",
  "frontend/src/pages/Dashboard/components/StatisticsSection.tsx": "Builds a reorderable statistics section containing stat cards and charts, persisting layout order in local storage.",
  "frontend/src/pages/DashboardPage.tsx": "Loads dashboard data, computes component statuses, manages section ordering, and renders statistics, charts, and actions.",
  "frontend/src/pages/ProfilePage.tsx": "React profile management page handling user info, avatar selection, expiration settings, and saving via backend mutations.",
  "frontend/src/pages/SignInPage.tsx": "Simple login screen using Internet Identity with error display and sign‑in button.",
  "frontend/src/utils/avatars.ts": "Maps avatar IDs to image paths and provides helpers to fetch avatar paths and IDs.",
  "frontend/src/utils/blobUpload.ts": "Uploads a File as an ExternalBlob with optional progress tracking.",
  "frontend/src/utils/defaultBenchPhoto.ts": "Fetches and converts a default test bench placeholder image into an ExternalBlob.",
  "frontend/src/utils/download.ts": "Downloads an ExternalBlob as a file by generating a temporary Blob URL.",
  "frontend/src/utils/expirationSettings.ts": "Manages expiration threshold logic with localStorage fallback and computes per‑bench expiration status.",
  "frontend/src/utils/id.ts": "Generates a simple unique ID using timestamp and random string.",
  "frontend/src/utils/rewriteDescription.ts": "Heuristically rewrites bench descriptions by normalizing whitespace, capitalization, punctuation, and abbreviations.",
  "frontend/src/utils/search.ts": "Searches test benches by matching query terms against name, code, description, and tags.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL and session parameters including hash‑based routing support.",
  "frontend/src/utils/validation.ts": "Validates email, domain, AGILE code, semantic versions, and URLs with basic rules.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "frontend/tsconfig.node.json": "TypeScript config for Node‑side tooling using ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Vite config enabling React, environment variable injection, path aliasing, dev server proxying, and build output settings.",
  "project_state.json": "Project state describing UI update requests, including avatar consistency and Safran image sizing adjustments, with metadata on features and requests."
}