{
  "backend/main.mo": "Defines backend actor with access control, blob storage mixins, and data models for users, documents, benches, components, and history.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend source files and their responsibilities.",
  "frontend/DEPLOYMENT_PRODUCTION_DRAFT_V36.md": "Production deployment checklist for Draft Version 36 detailing required environment variables, build steps, and backend health checks.",
  "frontend/DEPLOYMENT_PRODUCTION_DRAFT_V47.md": "Production deployment checklist for Draft Version 47 covering environment verification, build preparation, and backend readiness.",
  "frontend/DEPLOYMENT_PRODUCTION_DRAFT_V48.md": "Deployment checklist for Draft Version 48 outlining required environment variables and mainnet verification steps.",
  "frontend/DEPLOYMENT_PRODUCTION_DRAFT_V51.md": "Deployment checklist for Draft Version 51 describing required environment variables and production verification commands.",
  "frontend/index.css": "Tailwind CSS configuration defining global theme variables for light and dark modes and basic styling.",
  "frontend/index.html": "Basic HTML entry point embedding the app root and loading the main TypeScript bundle.",
  "frontend/README_PRODUCTION_ENV.md": "Documentation of required production environment variables for frontend builds, including canister IDs, Internet Identity URL, and network config.",
  "frontend/SMOKE_TEST_PRODUCTION_DRAFT_V36.md": "Smoke test script for Draft Version 36 validating authentication, navigation, and profile flows after production deployment.",
  "frontend/SMOKE_TEST_PRODUCTION_DRAFT_V47.md": "Step-by-step smoke test script for validating authentication, protected routes, and user profile persistence for Draft Version 47.",
  "frontend/SMOKE_TEST_PRODUCTION_DRAFT_V48.md": "Detailed production smoke test procedures for Draft Version 48 covering authentication, profile setup, and persistence with required diagnostics.",
  "frontend/SMOKE_TEST_PRODUCTION_DRAFT_V51.md": "Smoke test procedures for Draft Version 51 mirroring V48 tests, focusing on authentication, profile creation, and data persistence.",
  "frontend/SMOKE_TEST_PRODUCTION_RESULTS_V36.md": "Template for recording smoke test results for Draft Version 36, including sign‑in test status and notes.",
  "frontend/SMOKE_TEST_PRODUCTION_RESULTS_V47.md": "Template for documenting results of the Draft Version 47 smoke test, mainly covering Internet Identity sign‑in.",
  "frontend/SMOKE_TEST_PRODUCTION_RESULTS_V48.md": "Unified results template for smoke tests of Draft Versions 48 and 51, including authentication and initial access outcomes.",
  "frontend/src/App.tsx": "Main React application setup configuring routing, theming, error boundaries, and protected page layouts.",
  "frontend/src/components/admin/AdminGate.tsx": "Authorization gate that checks admin privileges and conditionally renders admin content or an access‑denied message.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary component that displays an error alert and reload option when runtime errors occur.",
  "frontend/src/components/auth/ActorGate.tsx": "Checks backend actor availability, showing a loading spinner or error alert before rendering children.",
  "frontend/src/components/auth/AuthGate.tsx": "Ensures user authentication via Internet Identity, redirecting or prompting login when needed.",
  "frontend/src/components/dnd/DraggableList.tsx": "Renders a list of draggable items with visual feedback and drag event handlers.",
  "frontend/src/components/dnd/useDraggableOrder.ts": "Provides state and handlers to reorder items through drag-and-drop interactions.",
  "frontend/src/components/export/ExportDialog.tsx": "Displays export options, validates selections, and triggers data export in various formats.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with navigation, theme toggle, profile menu, and export dialog.",
  "frontend/src/components/navigation/ScrollShortcuts.tsx": "Shows floating buttons to quickly scroll to the top or bottom based on scroll position.",
  "frontend/src/components/profile/EntityTagInput.tsx": "Manages a single entity tag with input, suggestions, and add/remove interactions.",
  "frontend/src/components/profile/PredefinedAvatarPicker.tsx": "Displays a grid of selectable predefined avatars with visual selection highlighting.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user avatar from predefined or custom sources with cache busting support.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Toggles between light and dark themes using next-themes.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAvatarCacheBuster.ts": "Zustand store that tracks a timestamp to force avatar cache refreshes.",
  "frontend/src/hooks/useDashboardChartType.ts": "Stores and persists the user's preferred dashboard chart type in localStorage.",
  "frontend/src/hooks/useExportDialogData.ts": "Fetches benches and unique component names for the export dialog once an actor is available.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication, state management, and AuthClient integration via React context.",
  "frontend/src/hooks/useLastSeenHeartbeat.ts": "Periodically calls updateLastSeen on the actor to record user activity.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on benches, profiles, expiration settings, and related data.",
  "frontend/src/i18n/I18nProvider.tsx": "Manages language selection, initialization, and persistence using backend values or localStorage.",
  "frontend/src/i18n/languages.ts": "Defines supported languages and helpers to validate, name, and display them.",
  "frontend/src/i18n/translations.ts": "Provides translation strings for supported languages, primarily English.",
  "frontend/src/i18n/useI18n.ts": "Custom hook for translation lookup with fallback and key humanization.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider.",
  "frontend/src/pages/Admin/AdminPage.tsx": "Renders the admin page with tabs for benches, documents, and users.",
  "frontend/src/pages/Admin/components/AdminBenchesPanel.tsx": "Displays all test benches with delete functionality and loading states.",
  "frontend/src/pages/Admin/components/AdminDocumentsPanel.tsx": "Lists documents with metadata and provides download support.",
  "frontend/src/pages/Admin/components/AdminUsersPanel.tsx": "Shows the current user's profile and preference settings.",
  "frontend/src/pages/Benches/BenchDetailPage.tsx": "Displays details for a specific bench with components, history, and edit/remove actions.",
  "frontend/src/pages/Benches/BenchListPage.tsx": "Shows a searchable list of benches with an option to add new ones.",
  "frontend/src/pages/Benches/components/AddBenchModal.tsx": "Modal component for creating a new test bench with fields for metadata, tags, documents, components, validation, and file uploads.",
  "frontend/src/pages/Benches/components/BenchComponentsTableEditor.tsx": "Editor table for adding, editing, removing, and duplicating bench components with expiration status tracking.",
  "frontend/src/pages/Benches/components/BenchDocumentsEditor.tsx": "Manages bench documents including loading, uploading, editing, duplicating, deleting, and categorizing files.",
  "frontend/src/pages/Benches/components/BenchHistoryList.tsx": "Displays a chronological history of bench actions with user info, timestamps, and optional details.",
  "frontend/src/pages/Benches/components/BenchPhoto.tsx": "Renders a bench photo with loading and error handling, falling back to a placeholder on failure.",
  "frontend/src/pages/Benches/components/DocumentCategoriesInput.tsx": "Form input for managing document categories and associated files, supporting adding, removing, and versioning.",
  "frontend/src/pages/Benches/components/DuplicateComponentDialog.tsx": "Dialog allowing users to select multiple benches and duplicate a component to them using mutation hooks. Handles selection, submission, error handling, and UI feedback.",
  "frontend/src/pages/Benches/components/DuplicateDocumentDialog.tsx": "Dialog for duplicating a document to selected benches that don’t already contain it, with loading states and translation support. Uses mutation hooks and displays validation and success toasts.",
  "frontend/src/pages/Benches/components/EditBenchDocumentDialog.tsx": "Dialog enabling users to edit a bench document’s metadata and optionally upload a replacement file. Manages file uploads, progress tracking, validation, and save mutation.",
  "frontend/src/pages/Benches/components/EditBenchModal.tsx": "Form modal for editing a bench’s details, tags, URLs, description, and photo, with validation and optional photo upload. Submits updates through a mutation and displays errors or success.",
  "frontend/src/pages/Benches/components/MoveComponentDialog.tsx": "Dialog for moving a component from one bench to another by selecting a single destination bench. Handles validation, mutation, and success/error notifications.",
  "frontend/src/pages/Benches/components/TagsInput.tsx": "React tag input component supporting adding, removing, and selecting tags with suggestions and a popover UI.",
  "frontend/src/pages/Benches/NewBenchPage.tsx": "Placeholder page for creating a new test bench, showing an upcoming form and listing planned features.",
  "frontend/src/pages/Dashboard/components/MovementFlowSection.tsx": "Processes bench movement history to count source‑destination transfers and displays them as a ranked flow list with progress bars.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ComponentsByStatusPieCard.tsx": "Aggregates component expiration statuses and renders them as a pie chart with OK, expiring, and expired segments.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/CriticalityChartCard.tsx": "Builds per‑bench expiration status counts and displays them in a bar chart grouped by OK, expiring soon, and expired.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DeadlineChartCard.tsx": "Groups components by expiration date ranges and visualizes the distribution in a bar chart.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DocumentsByCategoryPieCard.tsx": "Counts documents by category and displays the distribution as a pie chart.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpirationTrendChartCard.tsx": "Aggregates components by expiration month and displays the trend as either a bar or line chart.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpiredByBenchChartCard.tsx": "Calculates per-bench expired component counts and displays them in either a bar or line chart with i18n support.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/HealthGaugeCard.tsx": "Computes overall component health percentages and renders a gauge-like set of progress bars.",
  "frontend/src/pages/Dashboard/components/StatisticsSection.tsx": "Assembles and orders all dashboard statistics charts using drag-and-drop and prepares data for each chart component.",
  "frontend/src/pages/DashboardPage.tsx": "Loads dashboard data, manages section ordering, and renders main dashboard sections including statistics and movement flow.",
  "frontend/src/pages/ProfilePage.tsx": "Handles user profile editing, including personal info, expiration thresholds, avatar selection, and language settings.",
  "frontend/src/pages/SignInPage.tsx": "Provides a login interface using Internet Identity with error handling and automatic redirect when authenticated.",
  "frontend/src/pages/Users/UserProfileDetailsPage.tsx": "Displays a public user profile by principal ID, handling loading, errors, and invalid IDs, and shows avatar, username, and entity details.",
  "frontend/src/utils/avatars.ts": "Defines a static map of avatar IDs to image paths and provides helpers to lookup an avatar path or list all IDs.",
  "frontend/src/utils/blobUpload.ts": "Uploads a file by converting it into an ExternalBlob with optional progress tracking.",
  "frontend/src/utils/defaultBenchPhoto.ts": "Fetches and returns a default bench placeholder image as an ExternalBlob, with error handling.",
  "frontend/src/utils/download.ts": "Provides utilities to download documents or arbitrary blobs by creating temporary object URLs.",
  "frontend/src/utils/errors.ts": "Normalizes various error types into user-friendly messages, mapping common backend errors to clearer text.",
  "frontend/src/utils/expirationSettings.ts": "Manages expiration threshold settings, including localStorage persistence and utilities to compute expiration status.",
  "frontend/src/utils/export/benchExpertZip.ts": "Generates a text-based export of bench expert data, assembling bench, component, and movement details into a downloadable file.",
  "frontend/src/utils/export/exportFilters.ts": "Filters export payloads based on selected benches, components, and history options, building structured filtered results.",
  "frontend/src/utils/export/exportGenerators.ts": "Implements CSV, TXT, and SQLite export generation for filtered data and triggers file downloads.",
  "frontend/src/utils/export/sqliteExport.ts": "Dynamically loads sql.js and builds a SQLite database containing benches, components, and history tables.",
  "frontend/src/utils/id.ts": "Generates a unique ID using the current timestamp and a random string segment.",
  "frontend/src/utils/rewriteDescription.ts": "Cleans and normalizes bench descriptions by adjusting spacing, capitalization, punctuation, and common abbreviations.",
  "frontend/src/utils/search.ts": "Performs case‑insensitive multi-term search across bench names, codes, descriptions, and tag names.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/validation.ts": "Validates emails, AGILE codes, semantic versions, and URLs with simple rule-based checks.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, colors, animations, and plugins for the frontend.",
  "frontend/tsconfig.node.json": "Defines TypeScript config for Node-related build files with ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Sets up Vite with React, environment variable loading, path aliases, dev server proxying, and build output settings.",
  "project_state.json": "Describes current project state, approved features, metadata, and versioning for deployment planning."
}