{
  "backend/main.mo": "Defines the backend actor with access control, blob storage mixins, and data models for benches, documents, components, history, and user profiles, plus query methods like getAllTestBenches.",
  "feature_evidence.json": "Contains a feature evidence report describing added UI language support and listing related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of numerous frontend files including components, pages, hooks, utils, and styles.",
  "frontend/index.css": "Defines global Tailwind layers and OKLCH-based color variables for light and dark themes.",
  "frontend/index.html": "Minimal HTML document that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up routing, query client, theming, i18n provider, and protected vs public route handling with AppShell and error boundary.",
  "frontend/src/components/admin/AdminGate.tsx": "Checks admin status via useIsCallerAdmin and conditionally renders loading, access denied, or wrapped content with i18n messages.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that displays a styled error alert with reload option when rendering fails.",
  "frontend/src/components/auth/ActorGate.tsx": "Ensures backend actor initialization and shows loading or connection error states before rendering children.",
  "frontend/src/components/auth/AuthGate.tsx": "Handles Internet Identity authentication, redirecting unauthenticated users to sign-in and showing inline login UI if needed.",
  "frontend/src/components/dnd/DraggableList.tsx": "Reusable drag‑and‑drop list component supporting drag events, reordering callbacks, and custom item rendering.",
  "frontend/src/components/dnd/useDraggableOrder.ts": "Provides a hook to manage drag-and-drop reordering of a list with handlers for drag events and resetting order.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application layout with navigation, theming, admin-aware links, and a user menu with sign-out logic.",
  "frontend/src/components/navigation/ScrollShortcuts.tsx": "Shows buttons to scroll to top or bottom based on scroll position and provides smooth scrolling handlers.",
  "frontend/src/components/profile/EntityTagInput.tsx": "Implements an input for selecting or typing a single entity tag with suggestions, add/remove logic, and validation UI.",
  "frontend/src/components/profile/PredefinedAvatarPicker.tsx": "Renders a grid of selectable predefined avatars using provided IDs and highlights the selected one.",
  "frontend/src/components/profile/UserAvatar.tsx": "Displays a user avatar from predefined or custom sources with cache-busting support and size variations.",
  "frontend/src/components/theme/ThemeToggle.tsx": "A button that toggles the theme between light and dark using next-themes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAvatarCacheBuster.ts": "Provides a Zustand store with a timestamp used to force avatar image cache refreshes.",
  "frontend/src/hooks/useDashboardChartType.ts": "Stores and persists the user’s preferred dashboard chart type in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context, managing login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useLastSeenHeartbeat.ts": "Periodically calls an actor method to update the user’s last-seen timestamp when authenticated.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for loading and mutating backend data such as test benches, user profiles, roles, and preferences.",
  "frontend/src/i18n/I18nProvider.tsx": "Implements an i18n context that loads and persists the user's language preference using backend data and localStorage.",
  "frontend/src/i18n/languages.ts": "Defines supported language metadata and helper functions for validating and retrieving language names and flags.",
  "frontend/src/i18n/translations.ts": "Declares all translation keys used throughout the UI.",
  "frontend/src/i18n/useI18n.ts": "Exposes translation helpers and current language state from the i18n context.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for themes including dark mode.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/Admin/AdminPage.tsx": "Renders the admin dashboard with tabs for benches, documents, and user management.",
  "frontend/src/pages/Admin/components/AdminBenchesPanel.tsx": "Displays all test benches for admins with loading state and deletion workflow.",
  "frontend/src/pages/Admin/components/AdminDocumentsPanel.tsx": "Lists all documents with metadata and allows downloading each, showing loading and empty states.",
  "frontend/src/pages/Admin/components/AdminUsersPanel.tsx": "Displays the current user's profile including expiration preferences and dashboard settings, with loading and missing-profile handling.",
  "frontend/src/pages/Benches/BenchDetailPage.tsx": "Shows detailed information for a bench, including components, documents, history, and supports editing, duplication, and removal.",
  "frontend/src/pages/Benches/BenchListPage.tsx": "Displays a searchable list of test benches with photos and supports adding new benches.",
  "frontend/src/pages/Benches/components/AddBenchModal.tsx": "Modal form for creating a new test bench with fields for metadata, photo upload, documents, components, and duplication options.",
  "frontend/src/pages/Benches/components/BenchComponentsTableEditor.tsx": "Provides a table UI to add, edit, delete, and duplicate bench components with expiration status calculation.",
  "frontend/src/pages/Benches/components/BenchDocumentsEditor.tsx": "Manages uploading, listing, versioning, and deleting documents associated with a bench.",
  "frontend/src/pages/Benches/components/BenchHistoryList.tsx": "Displays a chronological list of bench history entries with user info and timestamps.",
  "frontend/src/pages/Benches/components/BenchPhoto.tsx": "Renders a bench photo with loading and fallback behavior on error.",
  "frontend/src/pages/Benches/components/DocumentCategoriesInput.tsx": "Allows selecting document categories and attaching files with versions for each category.",
  "frontend/src/pages/Benches/components/DuplicateComponentDialog.tsx": "Dialog for selecting benches to duplicate a component to, handling submission and validation.",
  "frontend/src/pages/Benches/components/EditBenchModal.tsx": "Modal form for editing a test bench, handling validation, photo upload, tag management, and submitting updates via mutation.",
  "frontend/src/pages/Benches/components/TagsInput.tsx": "Tag input component allowing adding, removing, and selecting tags with suggestions and keyboard support.",
  "frontend/src/pages/Benches/NewBenchPage.tsx": "Placeholder page describing planned features for creating a new test bench.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ComponentsByStatusPieCard.tsx": "Displays a pie chart summarizing component expiration statuses (ok, expiring soon, expired) across benches.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/CriticalityChartCard.tsx": "Renders a bar chart showing per-bench counts of components by expiration status.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DeadlineChartCard.tsx": "Generates a bar chart grouping components by expiration date ranges to show upcoming deadlines.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DocumentsByCategoryPieCard.tsx": "Pie chart showing document counts grouped by category such as Hardware, Software, or Other.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpirationTrendChartCard.tsx": "Displays monthly expiration counts using either a bar or line chart to show expiration trends over time.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpiredByBenchChartCard.tsx": "Renders a bar or line chart showing expired component counts per bench, using expiration thresholds and i18n labels.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/HealthGaugeCard.tsx": "Computes overall component health distribution and displays percentages with progress bars.",
  "frontend/src/pages/Dashboard/components/StatisticsSection.tsx": "Defines draggable dashboard statistic and chart cards and manages their order and rendering.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page that loads benches, components, documents, user profile, and displays statistics, charts, and actions.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page handling personal info, thresholds, avatar selection, language, and saving preferences.",
  "frontend/src/pages/SignInPage.tsx": "Sign‑in page using Internet Identity flow with status handling and redirect on authentication.",
  "frontend/src/utils/avatars.ts": "Maps avatar IDs to image paths and provides helpers to retrieve paths and list available avatars.",
  "frontend/src/utils/blobUpload.ts": "Uploads a file as an ExternalBlob with optional progress tracking.",
  "frontend/src/utils/defaultBenchPhoto.ts": "Loads and converts a default bench placeholder image into an ExternalBlob.",
  "frontend/src/utils/download.ts": "Provides a function to fetch bytes from an ExternalBlob and trigger a browser file download.",
  "frontend/src/utils/errors.ts": "Normalizes unknown error values into readable messages, preserving backend-provided text when possible.",
  "frontend/src/utils/expirationSettings.ts": "Manages expiration-threshold settings with localStorage fallback and computes expiration status for dates.",
  "frontend/src/utils/id.ts": "Generates a unique string ID using the current timestamp and random characters.",
  "frontend/src/utils/rewriteDescription.ts": "Performs deterministic cleanup and formatting of bench descriptions, including capitalization and abbreviation normalization.",
  "frontend/src/utils/search.ts": "Filters test benches by matching search terms against name, agile code, description, and tags.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and persisting URL parameters, including support for hash-based routing.",
  "frontend/src/utils/validation.ts": "Provides validation helpers for email, domain-restricted email, AGILE codes, semantic versions, and URLs.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, fonts, animations, and plugins for the frontend.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-specific build files using ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Sets up Vite with React, environment variable support, path aliasing, dev server proxying, and build options.",
  "project_state.json": "Describes current project state, known issues, and feature requests related to localization and added languages."
}