{
  "backend/main.mo": "Main Motoko canister defining data types, authorization mixins, storage mixins, maps for benches, documents, components, history, and user profiles, plus several query methods including test bench retrieval.",
  "backend/migration.mo": "Defines a no-op migration that returns the old actor state as the new state during upgrades.",
  "feature_evidence.json": "Feature evidence manifest listing feature descriptions, related files, components, and test IDs for i18n and language‑persistence work.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend components, pages, hooks, and utilities.",
  "frontend/index.css": "Tailwind base style definitions with OKLCH color variables for light/dark themes and global CSS resets.",
  "frontend/index.html": "Basic HTML entry point that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Sets up tanstack router trees, authentication-protected layouts, theme and i18n providers, and mounts the application with React Query and an error boundary.",
  "frontend/src/components/admin/AdminGate.tsx": "Admin-only access gate that checks admin status and displays localized loading or access‑denied messages.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary showing an alert with reload option when an unhandled error occurs.",
  "frontend/src/components/auth/ActorGate.tsx": "Ensures the backend actor is initialized, showing a spinner or connection error before rendering children.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication guard that redirects unauthenticated users to sign‑in and shows inline login UI when needed.",
  "frontend/src/components/dnd/DraggableList.tsx": "A generic draggable list component that renders items with drag handlers and visual feedback for reordering.",
  "frontend/src/components/dnd/useDraggableOrder.ts": "A hook managing list reordering logic using drag events, tracking item order and dragged index.",
  "frontend/src/components/layout/AppShell.tsx": "The main app layout with navigation, admin links, theme toggle, and user menu including sign-out handling.",
  "frontend/src/components/navigation/ScrollShortcuts.tsx": "Shows floating buttons to scroll to top or bottom based on scroll position.",
  "frontend/src/components/profile/EntityTagInput.tsx": "A tag input allowing one entity selection with suggestions, add/remove behavior, and validation state.",
  "frontend/src/components/profile/PredefinedAvatarPicker.tsx": "Grid selector for choosing predefined avatar images with visual highlighting.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user avatar from predefined or custom sources with cache-busting support and size options.",
  "frontend/src/components/theme/ThemeToggle.tsx": "A button toggling between light and dark themes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, invalidating dependent queries when it updates.",
  "frontend/src/hooks/useAvatarCacheBuster.ts": "Zustand store providing a timestamp-based cache buster for avatar image refresh.",
  "frontend/src/hooks/useDashboardChartType.ts": "Manages the saved dashboard chart type preference synced to localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context and helpers for managing Internet Identity login and stored identity lifecycle.",
  "frontend/src/hooks/useLastSeenHeartbeat.ts": "Periodically calls the backend to update the user's last-seen timestamp when authenticated.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating backend data such as test benches, user profiles, roles, and preferences.",
  "frontend/src/i18n/I18nProvider.tsx": "Implements an i18n context that initializes and persists the user's language preference using backend and local storage.",
  "frontend/src/i18n/languages.ts": "Defines supported languages and helper functions for language lookup and validation.",
  "frontend/src/i18n/translations.ts": "Declares translation key types for all UI strings used across the application.",
  "frontend/src/i18n/useI18n.ts": "Exposes a translation hook that retrieves localized strings based on the current language context.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light and dark theme CSS variables for UI styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/Admin/AdminPage.tsx": "Renders the Admin dashboard with tabbed panels for benches, documents, and users.",
  "frontend/src/pages/Admin/components/AdminBenchesPanel.tsx": "Displays all test benches and provides UI for deleting benches with confirmation dialogs.",
  "frontend/src/pages/Admin/components/AdminDocumentsPanel.tsx": "Lists all documents for admins with loading state and allows downloading each document using a handler.",
  "frontend/src/pages/Admin/components/AdminUsersPanel.tsx": "Displays the current user's profile, expiration settings, and dashboard layout with loading and empty states.",
  "frontend/src/pages/Benches/BenchDetailPage.tsx": "Shows detailed information for a bench, including components, documents, history, and supports editing, removing, and duplicating components.",
  "frontend/src/pages/Benches/BenchListPage.tsx": "Displays a searchable list of benches with photos and supports adding a new bench via a modal.",
  "frontend/src/pages/Benches/components/AddBenchModal.tsx": "Modal form for creating a new bench, handling photo upload, metadata input, document categories, components, validation, and optional component duplication.",
  "frontend/src/pages/Benches/components/BenchComponentsTableEditor.tsx": "Provides a table UI for adding, editing, removing, and duplicating bench components with expiration status computation.",
  "frontend/src/pages/Benches/components/BenchDocumentsEditor.tsx": "Manages document upload, versioning, association, and deletion for a bench across predefined categories.",
  "frontend/src/pages/Benches/components/BenchHistoryList.tsx": "Displays a sorted list of bench history events with user info, timestamps, and optional details.",
  "frontend/src/pages/Benches/components/BenchPhoto.tsx": "Renders a bench photo with loading and error fallbacks using an ExternalBlob URL.",
  "frontend/src/pages/Benches/components/DocumentCategoriesInput.tsx": "Handles selection of document categories and uploading files with version metadata for each category.",
  "frontend/src/pages/Benches/components/DuplicateComponentDialog.tsx": "Dialog allowing a component to be duplicated to multiple other benches with selection and mutation handling.",
  "frontend/src/pages/Benches/components/EditBenchModal.tsx": "Modal form for editing a test bench, handling field validation, photo upload, and submitting updates.",
  "frontend/src/pages/Benches/components/TagsInput.tsx": "Tag input component allowing adding, removing, and selecting tags with suggestion filtering.",
  "frontend/src/pages/Benches/NewBenchPage.tsx": "Placeholder page describing planned features for creating a new bench with documents, tags, and metadata.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ComponentsByStatusPieCard.tsx": "Pie chart card showing counts of components by expiration status based on thresholds.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/CriticalityChartCard.tsx": "Bar chart card displaying per‑bench counts of components grouped by expiration status.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DeadlineChartCard.tsx": "Bar chart grouping component expirations into date ranges such as past, 0–30 days, and beyond.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DocumentsByCategoryPieCard.tsx": "Pie chart summarizing documents by category with fallback for unknown categories.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpirationTrendChartCard.tsx": "Bar or line chart showing monthly counts of component expirations over time.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpiredByBenchChartCard.tsx": "Builds bar or line charts showing expired components per bench based on thresholds and expiration status.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/HealthGaugeCard.tsx": "Calculates component health percentages and displays them using progress bars for OK, expiring soon, and expired items.",
  "frontend/src/pages/Dashboard/components/StatisticsSection.tsx": "Defines a draggable dashboard statistics section with stat cards and charts, restoring order from storage or defaults.",
  "frontend/src/pages/DashboardPage.tsx": "Loads dashboard data, computes component statuses, manages section ordering, and renders various statistic and chart components.",
  "frontend/src/pages/ProfilePage.tsx": "Manages user profile editing including thresholds, avatar selection, language, validation, and saving preferences.",
  "frontend/src/pages/SignInPage.tsx": "Displays a login screen using Internet Identity, handling errors and redirecting authenticated users.",
  "frontend/src/utils/avatars.ts": "Provides a map of avatar IDs to image paths and helpers to retrieve avatar paths and IDs.",
  "frontend/src/utils/blobUpload.ts": "Uploads files as ExternalBlob objects with optional progress tracking.",
  "frontend/src/utils/defaultBenchPhoto.ts": "Fetches and converts a default bench photo into an ExternalBlob for use as a placeholder.",
  "frontend/src/utils/download.ts": "Provides a helper to fetch bytes from an ExternalBlob and trigger a browser file download.",
  "frontend/src/utils/errors.ts": "Converts unknown error values into readable messages with fallbacks for various error shapes.",
  "frontend/src/utils/expirationSettings.ts": "Manages expiration-threshold settings using localStorage, profile overrides, and computes expiration states.",
  "frontend/src/utils/id.ts": "Generates a simple unique string ID using timestamp and random data.",
  "frontend/src/utils/rewriteDescription.ts": "Applies deterministic text cleanups to bench descriptions, including normalization and abbreviation fixes.",
  "frontend/src/utils/search.ts": "Filters test benches by matching query terms against bench fields and tags.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters with sessionStorage support and hash routing.",
  "frontend/src/utils/validation.ts": "Validates email, domain, agile code, semantic versions, and URLs with simple rule checks.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins for the frontend.",
  "frontend/tsconfig.node.json": "Defines TypeScript compiler settings for Node-related build files.",
  "frontend/vite.config.ts": "Sets up Vite with React, env var plugins, path aliases, dev server proxy, and build output settings.",
  "project_state.json": "Describes current project state, issues, and i18n requirements for instant UI language updates."
}