{
  "backend/main.mo": "Defines the main canister with access control, storage mixins, and data models for benches, documents, components, users, and related query/update APIs.",
  "backend/migration.mo": "Implements a migration ensuring all user profiles include required dashboard sections by updating the userProfileMap.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of major frontend files and utilities.",
  "frontend/index.css": "Tailwind base style definitions with OKLCH color variables for light and dark themes and global styling rules.",
  "frontend/index.html": "Base HTML entry point containing the root element and script bootstrapping the React application.",
  "frontend/src/App.tsx": "Sets up TanStack Router, authentication gates, layout, and protected routes within the themed application wrapper.",
  "frontend/src/components/admin/AdminGate.tsx": "Empty file placeholder for admin access control component.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that displays a fallback UI and reload option when runtime errors occur.",
  "frontend/src/components/auth/ActorGate.tsx": "Wraps children in backend-actor initialization logic, showing loading or error states when actor creation fails.",
  "frontend/src/components/auth/AuthGate.tsx": "Ensures a user is authenticated before rendering children, showing loading or error messages accordingly.",
  "frontend/src/components/dnd/DraggableList.tsx": "A generic draggable list component rendering items with drag handlers and visual feedback during reordering.",
  "frontend/src/components/dnd/useDraggableOrder.ts": "Hook managing drag-and-drop item reordering, tracking dragged index and updating item order.",
  "frontend/src/components/layout/AppShell.tsx": "Main application shell with navigation, theme toggle, logout handling, and responsive layout structure.",
  "frontend/src/components/navigation/ScrollShortcuts.tsx": "Displays scroll-to-top and scroll-to-bottom buttons based on current scroll position.",
  "frontend/src/components/profile/EntityTagInput.tsx": "Input component for selecting or typing a single entity tag with suggestion filtering and removal.",
  "frontend/src/components/profile/PredefinedAvatarPicker.tsx": "Grid selector for choosing from predefined avatar images with labels and visual selection state.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user avatar from predefined or custom sources, with cache busting and size options.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing backend actors based on identity and invalidating dependent queries when changed.",
  "frontend/src/hooks/useAvatarCacheBuster.ts": "Zustand store providing a cache-busting timestamp and method to refresh it.",
  "frontend/src/hooks/useDashboardChartType.ts": "Hook storing and persisting dashboard chart type preference in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, login state, and identity loading.",
  "frontend/src/hooks/useLastSeenHeartbeat.ts": "Hook periodically updating the user's last-seen timestamp via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating test benches, user profiles, roles, preferences, and related backend data.",
  "frontend/src/index.css": "Defines Tailwind base layers and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/Admin/AdminPage.tsx": "Empty admin page placeholder.",
  "frontend/src/pages/Admin/components/AdminBenchesPanel.tsx": "Empty placeholder for admin benches panel.",
  "frontend/src/pages/Admin/components/AdminDocumentsPanel.tsx": "Empty placeholder for admin documents panel.",
  "frontend/src/pages/Admin/components/AdminUsersPanel.tsx": "Empty placeholder for admin users panel.",
  "frontend/src/pages/Benches/BenchDetailPage.tsx": "Displays detailed test bench info with components, documents, history, and edit/remove actions.",
  "frontend/src/pages/Benches/BenchListPage.tsx": "Lists test benches with search, filtering, and an option to add a new bench.",
  "frontend/src/pages/Benches/components/AddBenchModal.tsx": "Modal form for creating a test bench with fields for metadata, tags, documents, components, and photo upload.",
  "frontend/src/pages/Benches/components/BenchComponentsTableEditor.tsx": "Editor table allowing adding, editing, removing bench components and computing expiration status badges.",
  "frontend/src/pages/Benches/components/BenchDocumentsEditor.tsx": "Manages document categories, uploads, versioning, and deletion for a bench with progress handling.",
  "frontend/src/pages/Benches/components/BenchHistoryList.tsx": "Displays sorted bench history entries with timestamps, user info, and optional details.",
  "frontend/src/pages/Benches/components/BenchPhoto.tsx": "Renders a bench photo with loading and error fallbacks before showing the blob image.",
  "frontend/src/pages/Benches/components/DocumentCategoriesInput.tsx": "Form input managing document categories and file uploads with version editing and removal.",
  "frontend/src/pages/Benches/components/EditBenchModal.tsx": "Modal for editing bench metadata, URLs, tags, description, and updating an optional photo.",
  "frontend/src/pages/Benches/components/TagsInput.tsx": "Tag input field supporting adding, removing, and selecting tag suggestions with validation.",
  "frontend/src/pages/Benches/NewBenchPage.tsx": "Placeholder page describing planned features for creating new benches.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ComponentsByStatusPieCard.tsx": "Computes component expiration statuses and displays their distribution in a pie chart. Shows message if no components exist.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/CriticalityChartCard.tsx": "Aggregates OK, expiring soon, and expired component counts with optional bench filtering and visualizes them as a bar chart. Uses Recharts and dropdowns for interaction.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DeadlineChartCard.tsx": "Groups components into time‑based expiration buckets depending on selected range and renders results as a bar chart. Supports bench and time‑range filtering.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DocumentsByCategoryPieCard.tsx": "Counts documents by category and displays the distribution in a pie chart. Shows placeholder when no documents are available.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpirationTrendChartCard.tsx": "Builds monthly expiration counts for components and visualizes trends as either a bar or line chart. Limits output to the most recent 12 months.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpiredByBenchChartCard.tsx": "Lists benches with expired components and charts the top ones using bar or line format. Hides chart if no expired items exist.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/HealthGaugeCard.tsx": "Calculates system-wide OK, expiring soon, and expired component percentages and visualizes them with progress bars. Displays totals and handles empty datasets.",
  "frontend/src/pages/Dashboard/components/StatisticsSection.tsx": "Renders draggable dashboard statistic and chart cards with saved ordering in localStorage.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page fetching benches, components, and documents, computing expiration stats, and managing section ordering and chart type.",
  "frontend/src/pages/ProfilePage.tsx": "Profile management page handling user info, thresholds, avatar settings, and saving preferences via backend hooks.",
  "frontend/src/pages/SignInPage.tsx": "Simple sign‑in screen using Internet Identity with error display and branded layout.",
  "frontend/src/utils/avatars.ts": "Maps avatar IDs to asset paths and provides helpers to retrieve paths and list all avatars.",
  "frontend/src/utils/blobUpload.ts": "Uploads a file as an ExternalBlob with optional progress tracking.",
  "frontend/src/utils/defaultBenchPhoto.ts": "Fetches and converts the default test bench placeholder image into an ExternalBlob.",
  "frontend/src/utils/download.ts": "Downloads an ExternalBlob as a file by generating a temporary URL and triggering browser download.",
  "frontend/src/utils/expirationSettings.ts": "Utilities for reading thresholds, computing effective bench thresholds, and determining expiration status.",
  "frontend/src/utils/id.ts": "Generates a simple unique ID using timestamp and random string.",
  "frontend/src/utils/rewriteDescription.ts": "Heuristically cleans and normalizes bench description text, fixing casing, spacing, and abbreviations.",
  "frontend/src/utils/search.ts": "Searches test benches by matching query terms against name, agile code, description, and tags.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (query and hash), persisting them in sessionStorage, and clearing them, with URL values taking precedence.",
  "frontend/src/utils/validation.ts": "Implements validation functions for emails, domain-restricted emails, AGILE codes, semantic versions, and URLs.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, container settings, and plugins such as typography and container queries.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related builds, enabling ESNext modules and including vite.config.ts.",
  "frontend/vite.config.ts": "Vite setup for a React app with environment variable loading, path aliasing, dev server proxying, and build output configuration.",
  "project_state.json": "Tracks project state, existing features, issues, and pending feature requests for the application's ongoing development."
}