{
  "backend/main.mo": "Main actor defining authorization, storage mixins, data types, maps, and query/mutation functions for test benches, documents, components, history, and user profiles.",
  "backend/migration.mo": "Migration module converting old actor state to a new format, primarily upgrading user profiles to include new fields like username, displayName, bio, and avatarUrl.",
  "feature_evidence.json": "Feature evidence file listing implemented features, affected files, components, and requirement IDs with high-confidence links to profile and i18n updates.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their purpose, functionality, and UI roles in the application.",
  "frontend/index.css": "Global Tailwind-based styling defining OKLCH color variables and theme tokens for light and dark modes.",
  "frontend/index.html": "Base HTML template that mounts the React application and loads the main entry script.",
  "frontend/src/App.tsx": "Root React app setup including routing, theming, query client, internationalization provider, and global app shell.",
  "frontend/src/components/admin/AdminGate.tsx": "Admin-only access gate that checks admin status and blocks unauthorized users with a permission error alert.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches rendering errors and shows a reloadable error alert.",
  "frontend/src/components/auth/ActorGate.tsx": "Handles backend actor loading state and errors, showing spinners or alerts before rendering children.",
  "frontend/src/components/auth/AuthGate.tsx": "Blocks access until user identity is loaded and authenticated, displaying loading or error messages.",
  "frontend/src/components/dnd/DraggableList.tsx": "Renders a draggable list UI with drag handlers and visual feedback for reordering items.",
  "frontend/src/components/dnd/useDraggableOrder.ts": "Hook managing item order and drag state, updating the list as items are dragged.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout with navigation, theme toggle, logout handling, and outlet rendering.",
  "frontend/src/components/navigation/ScrollShortcuts.tsx": "Shows buttons to scroll to top or bottom based on page scroll position.",
  "frontend/src/components/profile/EntityTagInput.tsx": "Input for selecting or typing a single entity tag with suggestions and tag removal.",
  "frontend/src/components/profile/PredefinedAvatarPicker.tsx": "Grid selector for predefined avatar images with highlighting of the selected option.",
  "frontend/src/components/profile/UserAvatar.tsx": "Displays a user avatar from predefined or custom sources with size options and cache busting.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor instance based on identity, handling initialization and query invalidation.",
  "frontend/src/hooks/useAvatarCacheBuster.ts": "Zustand store providing a timestamp to force avatar image cache invalidation.",
  "frontend/src/hooks/useDashboardChartType.ts": "Stores and persists preferred dashboard chart type in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, including identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useLastSeenHeartbeat.ts": "Sends periodic updateLastSeen calls to the backend when an actor and identity are available.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping actor methods for fetching and mutating user, bench, and settings data.",
  "frontend/src/i18n/I18nProvider.tsx": "Context provider managing language selection, loading preferences from backend, and saving updates.",
  "frontend/src/i18n/languages.ts": "Defines supported language metadata and a lookup helper by code.",
  "frontend/src/i18n/translations.ts": "Contains translation dictionaries for multiple languages covering common UI strings.",
  "frontend/src/i18n/useI18n.ts": "Hook exposing current language, setter, loading state, and a translation function.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/Admin/AdminPage.tsx": "Admin dashboard page with tabbed panels for managing benches, documents, and users.",
  "frontend/src/pages/Admin/components/AdminBenchesPanel.tsx": "Displays all test benches with loading state and supports deleting a bench via confirmation dialog.",
  "frontend/src/pages/Admin/components/AdminDocumentsPanel.tsx": "Lists all documents and allows downloading each file, with loading and error handling.",
  "frontend/src/pages/Admin/components/AdminUsersPanel.tsx": "Shows the logged-in user's profile information with loading and fallback states.",
  "frontend/src/pages/Benches/BenchDetailPage.tsx": "Provides detailed view of a single bench including components, documents, history, editing, and deletion features.",
  "frontend/src/pages/Benches/BenchListPage.tsx": "Displays searchable list of all benches and opens a modal to add a new bench.",
  "frontend/src/pages/Benches/components/AddBenchModal.tsx": "Modal form for creating a new bench with fields for metadata, photo upload, documents, tags, and component duplication.",
  "frontend/src/pages/Benches/components/BenchComponentsTableEditor.tsx": "Manages adding, editing, displaying, and removing bench components with expiration status and optional duplication actions.",
  "frontend/src/pages/Benches/components/BenchDocumentsEditor.tsx": "Handles uploading, listing, versioning, and deleting documents for a bench, including blob upload and association logic.",
  "frontend/src/pages/Benches/components/BenchHistoryList.tsx": "Displays sorted bench history entries with user info, timestamps, and optional details.",
  "frontend/src/pages/Benches/components/BenchPhoto.tsx": "Renders a bench photo with loading and error fallback behavior.",
  "frontend/src/pages/Benches/components/DocumentCategoriesInput.tsx": "Allows selecting document categories and managing files with versions for each category.",
  "frontend/src/pages/Benches/components/DuplicateComponentDialog.tsx": "Provides a dialog to duplicate a component to selected benches, with selection and mutation handling.",
  "frontend/src/pages/Benches/components/EditBenchModal.tsx": "Modal for editing bench details, tags, and photo with validation and update submission.",
  "frontend/src/pages/Benches/components/TagsInput.tsx": "Tag input component allowing users to add, remove, and select tags with autocomplete suggestions.",
  "frontend/src/pages/Benches/NewBenchPage.tsx": "Placeholder page describing planned features for creating a new bench.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ComponentsByStatusPieCard.tsx": "Generates a pie chart summarizing component expiration status across benches.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/CriticalityChartCard.tsx": "Displays a bar chart showing counts of components by criticality, optionally filtered by bench.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DeadlineChartCard.tsx": "Builds a bar chart grouping components by expiration deadlines with selectable time ranges and bench filter.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DocumentsByCategoryPieCard.tsx": "Renders a pie chart showing document counts grouped by category.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpirationTrendChartCard.tsx": "Charts monthly component expiration counts using either bar or line format.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpiredByBenchChartCard.tsx": "Shows top benches with expired components using a bar or line chart.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/HealthGaugeCard.tsx": "Displays overall component health percentages and counts using progress bars, handling empty data gracefully.",
  "frontend/src/pages/Dashboard/components/StatisticsSection.tsx": "Renders reorderable dashboard statistic and chart cards, loading saved ordering from local storage.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page fetching benches, components, and documents, computing expiration statuses, and rendering dashboard sections with reordering support.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page allowing editing personal info, thresholds, avatar settings, and saving preferences with validation.",
  "frontend/src/pages/SignInPage.tsx": "Sign‑in UI using Internet Identity with error handling and a login button.",
  "frontend/src/utils/avatars.ts": "Maps avatar IDs to asset paths and provides helpers to retrieve avatar paths and IDs.",
  "frontend/src/utils/blobUpload.ts": "Uploads a file as an ExternalBlob with optional progress tracking.",
  "frontend/src/utils/defaultBenchPhoto.ts": "Fetches and converts a default bench placeholder image into an ExternalBlob.",
  "frontend/src/utils/download.ts": "Downloads an ExternalBlob as a file by generating a temporary URL and triggering a browser download.",
  "frontend/src/utils/errors.ts": "Normalizes unknown errors into readable messages, preserving meaningful backend details when possible.",
  "frontend/src/utils/expirationSettings.ts": "Manages expiration thresholds with localStorage fallback and computes expiration status based on dates.",
  "frontend/src/utils/id.ts": "Generates a unique string ID using timestamp and random characters.",
  "frontend/src/utils/rewriteDescription.ts": "Applies deterministic text cleanup, capitalization, abbreviation normalization, and punctuation fixes to descriptions.",
  "frontend/src/utils/search.ts": "Searches test benches by matching query terms against name, code, description, and tags.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL and session parameters for routing and state retention.",
  "frontend/src/utils/validation.ts": "Provides validation helpers for email, domain-limited email, AGILE codes, semantic versions, and URLs.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, animations, and plugins.",
  "frontend/tsconfig.node.json": "TypeScript config for Node build scripts with ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Vite config enabling React, env var injection, path aliases, dev proxy, and build output settings.",
  "project_state.json": "Describes project state, feature requirements, known issues, and pending profile-related feature requests."
}