{
  "backend/main.mo": "Defines the backend actor with access control, storage mixins, and data models for users, documents, benches, components, and history.",
  "feature_evidence.json": "Feature evidence report documenting one logo‑replacement feature and its related components, tests, and metadata.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short functional descriptions used for documentation or build analysis.",
  "frontend/DEPLOYMENT_PRODUCTION_DRAFT_V36.md": "Production deployment checklist for Draft V36 detailing environment verification, build prep, and deployment steps.",
  "frontend/index.css": "Global Tailwind‑based theme definitions using OKLCH color tokens for light and dark modes.",
  "frontend/index.html": "Base HTML entry point loading the React application via main.tsx.",
  "frontend/README_PRODUCTION_ENV.md": "Documentation of required production environment variables for the frontend, including canister IDs and II configuration.",
  "frontend/SMOKE_TEST_PRODUCTION_DRAFT_V36.md": "Smoke test script for Draft V36 outlining sign‑in, routing, and profile persistence validation steps.",
  "frontend/src/App.tsx": "Main React app configuring public and protected router trees, global providers, and the application shell with error boundary.",
  "frontend/src/components/admin/AdminGate.tsx": "Checks if the user is an admin and blocks access with an alert if not.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches render errors and shows a reloadable error alert.",
  "frontend/src/components/auth/ActorGate.tsx": "Ensures backend actor availability, showing loading or error states before rendering children.",
  "frontend/src/components/auth/AuthGate.tsx": "Handles Internet Identity authentication, redirecting to sign-in or showing login prompts as needed.",
  "frontend/src/components/dnd/DraggableList.tsx": "Generic draggable list component that renders items with drag handlers and visual feedback.",
  "frontend/src/components/dnd/useDraggableOrder.ts": "Hook providing state and handlers for reordering items via drag-and-drop.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout with navigation, header, footer, theme toggle, and sign-out handling.",
  "frontend/src/components/navigation/ScrollShortcuts.tsx": "Shows floating buttons to scroll to top or bottom based on scroll position.",
  "frontend/src/components/profile/EntityTagInput.tsx": "Input component for selecting or typing a single entity tag with suggestions and removal support.",
  "frontend/src/components/profile/PredefinedAvatarPicker.tsx": "Grid selector for choosing from predefined avatar images.",
  "frontend/src/components/profile/UserAvatar.tsx": "Displays a user avatar from predefined or custom images with optional sizing.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Button that toggles between light and dark themes.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAvatarCacheBuster.ts": "Provides a timestamp-based value to force avatar image cache refreshes.",
  "frontend/src/hooks/useDashboardChartType.ts": "Stores and persists the selected dashboard chart type (Bar or Line) in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity loading via AuthClient.",
  "frontend/src/hooks/useLastSeenHeartbeat.ts": "Periodically notifies the backend of the user's activity by calling updateLastSeen.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data such as test benches, profiles, and preferences.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides language state, initializes it from backend or localStorage, and syncs updates to the server when authenticated.",
  "frontend/src/i18n/languages.ts": "Defines supported languages and helpers for validating and retrieving language labels and flags.",
  "frontend/src/i18n/translations.ts": "Defines translation key types used across localized UI text.",
  "frontend/src/i18n/useI18n.ts": "Exposes translation function and language state from the I18n context.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme CSS variables for colors and layout.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/Admin/AdminPage.tsx": "Renders the admin dashboard with tabs for benches, documents, and users using localized text.",
  "frontend/src/pages/Admin/components/AdminBenchesPanel.tsx": "Displays and manages test benches, including listing, loading state, and bench deletion with confirmation dialogs.",
  "frontend/src/pages/Admin/components/AdminDocumentsPanel.tsx": "Lists documents with metadata and provides download actions with loading and error handling.",
  "frontend/src/pages/Admin/components/AdminUsersPanel.tsx": "Shows the current user's profile, loading states, and preference details within the admin section.",
  "frontend/src/pages/Benches/BenchDetailPage.tsx": "Displays detailed bench info with components, history, editing, duplication, and deletion workflows.",
  "frontend/src/pages/Benches/BenchListPage.tsx": "Shows searchable list of benches with loading states and the ability to add new benches.",
  "frontend/src/pages/Benches/components/AddBenchModal.tsx": "Modal form for creating a new bench, handling photo upload, metadata, tags, documents, and component duplication.",
  "frontend/src/pages/Benches/components/BenchComponentsTableEditor.tsx": "Editor table for adding, editing, and removing bench components with expiration status handling.",
  "frontend/src/pages/Benches/components/BenchDocumentsEditor.tsx": "Allows uploading, associating, viewing, and deleting documents linked to a bench, grouped by category.",
  "frontend/src/pages/Benches/components/BenchHistoryList.tsx": "Displays chronological bench activity history with user info and action details.",
  "frontend/src/pages/Benches/components/BenchPhoto.tsx": "Renders a bench photo with loading and error fallback behavior.",
  "frontend/src/pages/Benches/components/DocumentCategoriesInput.tsx": "UI component for managing document categories and associated files with version inputs.",
  "frontend/src/pages/Benches/components/DuplicateComponentDialog.tsx": "Dialog allowing users to select benches and duplicate a component to them using API mutations with validation and toast feedback.",
  "frontend/src/pages/Benches/components/EditBenchModal.tsx": "Modal for editing bench details including metadata, photo upload, validation, and updating via API.",
  "frontend/src/pages/Benches/components/TagsInput.tsx": "Tag input component supporting adding, removing, and selecting suggested tags with filtering.",
  "frontend/src/pages/Benches/NewBenchPage.tsx": "Placeholder page for creating a new bench, displaying upcoming form features and planned capabilities.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ComponentsByStatusPieCard.tsx": "Pie chart card summarizing components across benches by expiration status using thresholds and i18n labels.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/CriticalityChartCard.tsx": "Bar chart showing per‑bench counts of components by expiration status with dynamic thresholds and i18n.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DeadlineChartCard.tsx": "Bar chart grouping components by time‑to‑expiration ranges and displaying counts per range.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DocumentsByCategoryPieCard.tsx": "Pie chart summarizing documents by category with color‑coded segments and i18n text.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpirationTrendChartCard.tsx": "Aggregates component expirations by month and displays them in a bar or line chart.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpiredByBenchChartCard.tsx": "Counts expired components per bench using profile thresholds and visualizes the results in a bar or line chart.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/HealthGaugeCard.tsx": "Computes overall component health percentages and displays them using progress bars.",
  "frontend/src/pages/Dashboard/components/StatisticsSection.tsx": "Defines draggable dashboard statistic and chart cards and initializes their default layout.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the dashboard, loads data for benches, components, and documents, and displays statistics, charts, and reorderable sections.",
  "frontend/src/pages/ProfilePage.tsx": "Manages user profile settings including personal info, expiration preferences, avatars, and language selection.",
  "frontend/src/pages/SignInPage.tsx": "Renders the sign-in UI using Internet Identity, handles login state, and redirects authenticated users to the dashboard.",
  "frontend/src/pages/Users/UserProfileDetailsPage.tsx": "Displays a public user profile by principal, handling loading, invalid IDs, and missing user data with appropriate UI states.",
  "frontend/src/utils/avatars.ts": "Defines a map of avatar IDs to image paths and provides helpers to get avatar paths and list all avatar IDs.",
  "frontend/src/utils/blobUpload.ts": "Uploads a file as an ExternalBlob with optional progress tracking.",
  "frontend/src/utils/defaultBenchPhoto.ts": "Fetches and converts a default bench placeholder image into an ExternalBlob.",
  "frontend/src/utils/download.ts": "Downloads an ExternalBlob as a file by converting its bytes into a browser-triggered download.",
  "frontend/src/utils/errors.ts": "Normalizes various error formats into user-friendly messages with custom mappings for common backend errors.",
  "frontend/src/utils/expirationSettings.ts": "Manages expiration threshold settings with localStorage support and computes expiration status for items.",
  "frontend/src/utils/id.ts": "Generates a simple unique ID using timestamp and random string.",
  "frontend/src/utils/rewriteDescription.ts": "Heuristically rewrites bench descriptions by normalizing text, capitalization, punctuation, and common abbreviations.",
  "frontend/src/utils/search.ts": "Provides text-based search over test benches by matching query terms against multiple bench fields.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/validation.ts": "Validates emails, domains, AGILE codes, semantic versions, and URLs with simple client-side rules.",
  "frontend/tailwind.config.js": "Defines TailwindCSS config with custom OKLCH color palette, animations, fonts, and plugins for typography, container queries, and animations.",
  "frontend/tsconfig.node.json": "TypeScript config for Vite’s node environment enabling ESNext modules and including vite.config.ts.",
  "frontend/vite.config.ts": "Vite setup with React plugin, env var injection, path alias, dev server proxy, and build output settings.",
  "project_state.json": "Stores project metadata, feature requests, and requirements related to replacing the Safran logo asset."
}