{
  "backend/main.mo": "Defines core domain types, maps, and access-controlled query functions for managing benches, documents, components, users, and storage.",
  "feature_evidence.json": "Feature evidence report linking a frontend query file to a specific requirement with metadata and component versions.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files for reference or documentation.",
  "frontend/index.css": "Tailwind base layers with OKLCH color variables for light and dark themes and global styling rules.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, protected routes, theme provider, and renders the main application shell.",
  "frontend/src/components/admin/AdminGate.tsx": "Empty placeholder file for an admin access gate component.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches rendering errors and displays a recovery UI with reload option.",
  "frontend/src/components/auth/ActorGate.tsx": "Ensures backend actor availability before rendering protected content with loading and error fallback.",
  "frontend/src/components/auth/AuthGate.tsx": "Blocks access until user authentication loads and shows an error when not signed in.",
  "frontend/src/components/dnd/DraggableList.tsx": "Generic draggable list component enabling item reordering via drag-and-drop.",
  "frontend/src/components/dnd/useDraggableOrder.ts": "Hook managing drag-and-drop item order state with handlers for drag start, over, and end.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout component providing navigation, theme toggle, logout, and routing outlet with mobile and desktop nav bars.",
  "frontend/src/components/navigation/ScrollShortcuts.tsx": "Shows buttons to scroll to top or bottom based on scroll position and handles smooth scrolling.",
  "frontend/src/components/profile/EntityTagInput.tsx": "Single-value entity tag input with add/remove logic, suggestion filtering, and popover-based selection.",
  "frontend/src/components/profile/PredefinedAvatarPicker.tsx": "Grid-based selector for predefined avatar images using provided avatar IDs and labels.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user avatar from predefined or custom images with size options and cache-busting support.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useAvatarCacheBuster.ts": "Zustand store that tracks a timestamp value to force reloads of cached avatar images.",
  "frontend/src/hooks/useDashboardChartType.ts": "Stores and persists the user's preferred dashboard chart type in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context for Internet Identity, managing login, logout, identity loading, and status.",
  "frontend/src/hooks/useLastSeenHeartbeat.ts": "Periodically calls the backend to update the user's last-seen timestamp when authenticated.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating test benches, user profiles, roles, and expiration settings via an actor API.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and base styles.",
  "frontend/src/main.tsx": "Application entry point initializing React, React Query, identity provider, and global styles.",
  "frontend/src/pages/Admin/AdminPage.tsx": "Empty placeholder for the admin page component.",
  "frontend/src/pages/Admin/components/AdminBenchesPanel.tsx": "Empty placeholder for the admin benches panel component.",
  "frontend/src/pages/Admin/components/AdminDocumentsPanel.tsx": "Empty placeholder for the admin documents panel component.",
  "frontend/src/pages/Admin/components/AdminUsersPanel.tsx": "Empty placeholder for the admin users panel component.",
  "frontend/src/pages/Benches/BenchDetailPage.tsx": "Displays detailed information for a single test bench with editing, component management, history, and deletion features.",
  "frontend/src/pages/Benches/BenchListPage.tsx": "Lists all test benches with search, filtering, and a modal for creating new benches.",
  "frontend/src/pages/Benches/components/AddBenchModal.tsx": "Modal for creating a new test bench with fields for metadata, photo upload, tags, documents, and component duplication.",
  "frontend/src/pages/Benches/components/BenchComponentsTableEditor.tsx": "Provides a table UI to add, edit, remove, and duplicate bench components with validation and expiration status handling.",
  "frontend/src/pages/Benches/components/BenchDocumentsEditor.tsx": "Manages document uploads, versioning, association, and deletion for a bench across predefined categories.",
  "frontend/src/pages/Benches/components/BenchHistoryList.tsx": "Displays a chronological list of bench history entries with user info and timestamps.",
  "frontend/src/pages/Benches/components/BenchPhoto.tsx": "Renders a bench photo with loading and error fallback handling.",
  "frontend/src/pages/Benches/components/DocumentCategoriesInput.tsx": "Allows selecting document categories and attaching files with version fields for each category.",
  "frontend/src/pages/Benches/components/DuplicateComponentDialog.tsx": "Dialog to copy a component to multiple other benches with selection controls and mutation handling.",
  "frontend/src/pages/Benches/components/EditBenchModal.tsx": "Modal form to edit bench metadata, tags, and photo with validation and update submission.",
  "frontend/src/pages/Benches/components/TagsInput.tsx": "Interactive tag input allowing adding, removing, and selecting suggested tags with filtering and popover UI.",
  "frontend/src/pages/Benches/NewBenchPage.tsx": "Placeholder page outlining planned features for creating a new test bench.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ComponentsByStatusPieCard.tsx": "Computes component expiration statuses and renders a pie chart summarizing OK, expiring soon, and expired counts.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/CriticalityChartCard.tsx": "Counts components by status with optional bench filtering and displays the results in a bar chart.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DeadlineChartCard.tsx": "Buckets components by expiration time ranges, supporting multiple time windows and bench filtering, and displays the data in a bar chart.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DocumentsByCategoryPieCard.tsx": "Aggregates documents by category and shows their distribution in a pie chart.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpirationTrendChartCard.tsx": "Groups components by expiration month and displays the last 12 months as a bar or line chart.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpiredByBenchChartCard.tsx": "Calculates expired component counts per bench and visualizes the top benches in a bar or line chart.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/HealthGaugeCard.tsx": "Displays overall component health percentages and totals using progress bars, handling empty data gracefully.",
  "frontend/src/pages/Dashboard/components/StatisticsSection.tsx": "Renders draggable dashboard statistic and chart cards with persisted ordering via localStorage.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page fetching benches, components, documents, and profile data to compute statuses and render multiple dashboard sections.",
  "frontend/src/pages/ProfilePage.tsx": "Profile management page allowing editing user info, expiration settings, and avatar selection with backend sync.",
  "frontend/src/pages/SignInPage.tsx": "Simple sign‑in screen using Internet Identity with error handling and a styled login card.",
  "frontend/src/utils/avatars.ts": "Maps avatar IDs to image paths and provides helpers to retrieve paths and available IDs.",
  "frontend/src/utils/blobUpload.ts": "Uploads a file as an ExternalBlob with optional progress tracking.",
  "frontend/src/utils/defaultBenchPhoto.ts": "Loads and converts a default bench placeholder image into an ExternalBlob.",
  "frontend/src/utils/download.ts": "Downloads a document by converting an ExternalBlob to a browser‑triggered file download.",
  "frontend/src/utils/expirationSettings.ts": "Utilities for reading, saving, and computing expiration thresholds and component expiration status.",
  "frontend/src/utils/id.ts": "Generates simple unique IDs using timestamps and random strings.",
  "frontend/src/utils/rewriteDescription.ts": "Cleans and normalizes text by fixing whitespace, capitalizing sentences, adding punctuation, and uppercasing known abbreviations.",
  "frontend/src/utils/search.ts": "Filters benches by matching all search terms against combined bench fields and tags.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL params, storing them in sessionStorage, and managing persisted parameters for routing.",
  "frontend/src/utils/validation.ts": "Contains validation utilities for emails, AGILE codes, semantic versions, and URLs.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, plugins, and custom animations for the frontend.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related build files, specifying module resolution and included vite config.",
  "frontend/vite.config.ts": "Vite setup with React, environment variable plugins, path aliasing, dev server proxy, and build output settings.",
  "project_state.json": "Tracks project state, issues, and feature requests related to fixing equipment duplication visibility in the destination bench Health Book."
}