{
  "backend/main.mo": "Main Motoko canister defining state, data types, access control, storage mixins, and user/test bench/document management structures.",
  "feature_evidence.json": "Feature evidence report describing implemented features, linked files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of frontend source files with short descriptive summaries for each file’s purpose.",
  "frontend/DEPLOYMENT_PRODUCTION_DRAFT_V36.md": "Production deployment checklist for Draft Version 36 outlining required environment checks and deployment steps.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color tokens, themes, and base styling.",
  "frontend/index.html": "HTML entry point that loads the React application via main.tsx.",
  "frontend/README_PRODUCTION_ENV.md": "Documentation of required production environment variables and their usage for the frontend.",
  "frontend/SMOKE_TEST_PRODUCTION_DRAFT_V36.md": "Smoke test script for validating core functionality after deploying Draft Version 36 to production.",
  "frontend/src/App.tsx": "Configures public and protected route trees, authentication gates, global providers, and selects the router based on the current path.",
  "frontend/src/components/admin/AdminGate.tsx": "Checks if the user is an admin and either renders children or shows a permissions error screen.",
  "frontend/src/components/AppErrorBoundary.tsx": "Implements a global React error boundary that displays an alert and reload option when errors occur.",
  "frontend/src/components/auth/ActorGate.tsx": "Ensures a backend actor is available, showing loading or error states before rendering children.",
  "frontend/src/components/auth/AuthGate.tsx": "Manages Internet Identity auth state, redirecting unauthenticated users and providing sign‑in UI.",
  "frontend/src/components/dnd/DraggableList.tsx": "Renders a draggable list UI and delegates drag events for item reordering.",
  "frontend/src/components/dnd/useDraggableOrder.ts": "Provides hook logic for drag‑and‑drop item reordering with state tracking.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application layout with navigation, theming, admin links, and sign‑out handling.",
  "frontend/src/components/navigation/ScrollShortcuts.tsx": "Shows floating buttons to scroll to top or bottom based on scroll position.",
  "frontend/src/components/profile/EntityTagInput.tsx": "Provides an entity tag input with suggestions, tag removal, and keyboard handling.",
  "frontend/src/components/profile/PredefinedAvatarPicker.tsx": "Grid-based selector that displays predefined avatars and lets users choose one via button clicks.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user avatar from predefined or custom images with cache-busting and fallback behavior.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Button that switches between light and dark themes using next-themes.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAvatarCacheBuster.ts": "Zustand store providing a timestamp value to force avatar image cache invalidation.",
  "frontend/src/hooks/useDashboardChartType.ts": "Manages dashboard chart type state and persists it to localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading and managing identities via AuthClient.",
  "frontend/src/hooks/useLastSeenHeartbeat.ts": "Periodically calls updateLastSeen on the backend when a valid actor and identity exist.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data such as profiles, test benches, and settings.",
  "frontend/src/i18n/I18nProvider.tsx": "Initializes and manages the app’s language preference from localStorage or backend and exposes it via context.",
  "frontend/src/i18n/languages.ts": "Defines supported languages and helper functions for validating and displaying language metadata.",
  "frontend/src/i18n/translations.ts": "Defines a large union type of all translation keys used across the app.",
  "frontend/src/i18n/useI18n.ts": "Provides a hook that returns the active language, setters, loading state, and a translation function.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines light/dark CSS variables for theme colors.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/Admin/AdminPage.tsx": "Renders the admin page with tabs for benches, documents, and users using translated labels.",
  "frontend/src/pages/Admin/components/AdminBenchesPanel.tsx": "Displays all benches, supports deletion with confirmation, and shows relevant loading and empty states.",
  "frontend/src/pages/Admin/components/AdminDocumentsPanel.tsx": "Lists documents with metadata and allows downloading them with success and error handling.",
  "frontend/src/pages/Admin/components/AdminUsersPanel.tsx": "Shows the current user's profile, expiration preferences, and dashboard layout with loading and empty states.",
  "frontend/src/pages/Benches/BenchDetailPage.tsx": "Displays detailed bench info with editing, component management, deletion, history, and threshold logic.",
  "frontend/src/pages/Benches/BenchListPage.tsx": "Displays a searchable list of test benches with filtering, loading states, and an option to open the add-bench modal.",
  "frontend/src/pages/Benches/components/AddBenchModal.tsx": "Modal form for creating a new test bench, including photo upload, tags, documents, components, and validation.",
  "frontend/src/pages/Benches/components/BenchComponentsTableEditor.tsx": "Editable table for adding, modifying, and removing bench components with expiration status handling.",
  "frontend/src/pages/Benches/components/BenchDocumentsEditor.tsx": "Manages bench documents, including upload, association, deletion, and category-based organization.",
  "frontend/src/pages/Benches/components/BenchHistoryList.tsx": "Renders a chronological history of bench actions with user info and timestamps.",
  "frontend/src/pages/Benches/components/BenchPhoto.tsx": "Displays a bench photo with loading and error fallback behavior.",
  "frontend/src/pages/Benches/components/DocumentCategoriesInput.tsx": "Manages a list of document categories with selectable types and file uploads, supporting adding, removing, and versioning files.",
  "frontend/src/pages/Benches/components/DuplicateComponentDialog.tsx": "Dialog to duplicate a component to multiple benches, handling selection, mutation, validation, and success/error feedback.",
  "frontend/src/pages/Benches/components/EditBenchModal.tsx": "Modal for editing bench details including metadata, URLs, tags, and photo upload with validation and update mutation.",
  "frontend/src/pages/Benches/components/TagsInput.tsx": "Provides a tag entry UI allowing adding, removing, and selecting tags from suggestions with filtering.",
  "frontend/src/pages/Benches/NewBenchPage.tsx": "Placeholder page describing planned features for creating new test benches.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ComponentsByStatusPieCard.tsx": "Displays a pie chart summarizing components by expiration status across benches using thresholds and i18n labels.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/CriticalityChartCard.tsx": "Renders a bar chart per bench showing counts of components by expiration status using localized labels and thresholds.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DeadlineChartCard.tsx": "Builds a bar chart showing component counts by expiration date ranges and displays a fallback message when no data is available.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DocumentsByCategoryPieCard.tsx": "Aggregates documents by category and renders a pie chart with color‑coded segments or a no‑data message.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpirationTrendChartCard.tsx": "Groups component expirations by month and displays them as either a bar or line chart depending on the selected chart type.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpiredByBenchChartCard.tsx": "Computes expired component counts per bench based on user threshold settings and visualizes the results using a bar or line chart.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/HealthGaugeCard.tsx": "Calculates overall component health percentages (ok, expiring soon, expired) and shows them as progress bars.",
  "frontend/src/pages/Dashboard/components/StatisticsSection.tsx": "Defines a reorderable set of statistic and chart cards for the dashboard, including totals and criticality metrics.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page that loads benches, components, documents, and user settings, computes status metrics, and renders charts and sections accordingly.",
  "frontend/src/pages/ProfilePage.tsx": "Profile management page allowing users to edit personal info, avatar, language, and expiration preferences with backend integration.",
  "frontend/src/pages/SignInPage.tsx": "Sign‑in screen using Internet Identity, showing login status, errors, and redirecting authenticated users.",
  "frontend/src/pages/Users/UserProfileDetailsPage.tsx": "Displays public details of a user by principal ID, handling loading, invalid IDs, and missing profiles.",
  "frontend/src/utils/avatars.ts": "Defines predefined avatar image paths and utilities to retrieve avatar IDs and paths.",
  "frontend/src/utils/blobUpload.ts": "Uploads a file as an ExternalBlob with optional progress tracking.",
  "frontend/src/utils/defaultBenchPhoto.ts": "Fetches and converts the default test bench placeholder image into an ExternalBlob.",
  "frontend/src/utils/download.ts": "Downloads an ExternalBlob as a file by generating a temporary URL and triggering a browser download.",
  "frontend/src/utils/errors.ts": "Normalizes various error formats into user‑friendly messages with special handling for common backend errors.",
  "frontend/src/utils/expirationSettings.ts": "Manages expiration threshold logic with localStorage fallback and utilities for per‑bench threshold evaluation.",
  "frontend/src/utils/id.ts": "Generates a simple unique ID using timestamp and random string.",
  "frontend/src/utils/rewriteDescription.ts": "Cleans and normalizes bench descriptions by fixing capitalization, punctuation, and common abbreviations.",
  "frontend/src/utils/search.ts": "Searches test benches by matching query terms against name, codes, description, and tags.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store them in sessionStorage, retrieve them with fallback, and clear stored or hash-based parameters.",
  "frontend/src/utils/validation.ts": "Implements basic validators for emails, domain-restricted emails, AGILE codes, semantic versions, and optional URLs.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugin integrations.",
  "frontend/tsconfig.node.json": "Specifies TypeScript config for Node-focused builds, including module settings and included Vite config.",
  "frontend/vite.config.ts": "Defines Vite setup with React, environment variable injection, path aliasing, dev server proxy, and build output settings.",
  "project_state.json": "Stores project metadata, existing features, pending feature requests, and schema state for the public user profile view work."
}