{
  "backend/main.mo": "Main backend actor defining data models, maps, authorization mixins, and query methods for benches, documents, components, history, and user profiles.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their roles in routing, UI, state, validation, and feature functionality.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH-based theme tokens for light and dark modes.",
  "frontend/index.html": "Base HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main application routing setup with TanStack Router, authentication gates, theming, and global error boundary.",
  "frontend/src/components/admin/AdminGate.tsx": "Placeholder file with no implemented logic.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches rendering errors and displays a reload prompt.",
  "frontend/src/components/auth/ActorGate.tsx": "Gate component that waits for backend actor initialization and shows errors if the actor is unavailable.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication guard that blocks access until Internet Identity is loaded and authenticated.",
  "frontend/src/components/dnd/DraggableList.tsx": "Generic draggable list component rendering reorderable items with drag handlers.",
  "frontend/src/components/dnd/useDraggableOrder.ts": "Hook managing drag-and-drop reordering state for lists, including drag start, over, end, and reset.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with navigation, theme toggle, logout handling, and an Outlet for routed pages.",
  "frontend/src/components/navigation/ScrollShortcuts.tsx": "Shows scroll-to-top and scroll-to-bottom buttons based on scroll position and performs smooth scrolling.",
  "frontend/src/components/profile/EntityTagInput.tsx": "Single-value tag input with suggestions, allowing adding, removing, and selecting predefined entities.",
  "frontend/src/components/profile/PredefinedAvatarPicker.tsx": "Renders a grid of predefined avatars and notifies selection changes.",
  "frontend/src/components/profile/UserAvatar.tsx": "Displays a user avatar from predefined or custom images with cache-busting and size options.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAvatarCacheBuster.ts": "Zustand store that tracks a timestamp used to force-refresh avatar image URLs.",
  "frontend/src/hooks/useDashboardChartType.ts": "Manages persistent chart type preference using localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout logic, and identity persistence through context.",
  "frontend/src/hooks/useLastSeenHeartbeat.ts": "Periodically updates the user's last-seen timestamp via the backend actor when authenticated.",
  "frontend/src/hooks/useQueries.ts": "Defines many React Query hooks for fetching and mutating test benches, user profiles, roles, expiration settings, and related data through the backend actor.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark CSS variables for colors, layout, and theme styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and loads global styles.",
  "frontend/src/pages/Admin/AdminPage.tsx": "Empty placeholder file for the Admin page.",
  "frontend/src/pages/Admin/components/AdminBenchesPanel.tsx": "Empty placeholder component for managing benches in the Admin panel.",
  "frontend/src/pages/Admin/components/AdminDocumentsPanel.tsx": "Empty placeholder component for managing documents in the Admin panel.",
  "frontend/src/pages/Admin/components/AdminUsersPanel.tsx": "Empty placeholder component for managing users in the Admin panel.",
  "frontend/src/pages/Benches/BenchDetailPage.tsx": "Displays detailed information about a single test bench, including components, history, and edit/remove actions.",
  "frontend/src/pages/Benches/BenchListPage.tsx": "Shows a searchable list of all test benches with filtering, photos, and navigation to detail pages.",
  "frontend/src/pages/Benches/components/AddBenchModal.tsx": "Implements a modal dialog for creating new benches, handling form fields, uploads, validation, and component duplication.",
  "frontend/src/pages/Benches/components/BenchComponentsTableEditor.tsx": "Editable table for adding, editing, removing, and duplicating bench components with expiration status calculation.",
  "frontend/src/pages/Benches/components/BenchDocumentsEditor.tsx": "Handles uploading, versioning, listing, and deleting categorized bench documents with progress tracking.",
  "frontend/src/pages/Benches/components/BenchHistoryList.tsx": "Displays sorted bench history entries showing actions, timestamps, user info, and optional details.",
  "frontend/src/pages/Benches/components/BenchPhoto.tsx": "Renders a bench photo with loading and error fallback handling.",
  "frontend/src/pages/Benches/components/DocumentCategoriesInput.tsx": "Allows selecting document categories and adding files with versions for each category.",
  "frontend/src/pages/Benches/components/DuplicateComponentDialog.tsx": "Dialog for selecting benches and duplicating a component to multiple benches.",
  "frontend/src/pages/Benches/components/EditBenchModal.tsx": "Modal for editing bench details, tags, URLs, and photo with validation and update submission.",
  "frontend/src/pages/Benches/components/TagsInput.tsx": "Interactive tag input component allowing adding, removing, and selecting tags with suggestion filtering.",
  "frontend/src/pages/Benches/NewBenchPage.tsx": "Provides a placeholder page describing planned features for creating new test benches.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ComponentsByStatusPieCard.tsx": "Builds a pie chart summarizing component health status counts across benches.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/CriticalityChartCard.tsx": "Displays a bar chart of component criticality counts with optional bench filtering.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DeadlineChartCard.tsx": "Generates a deadline-distribution bar chart grouping components into time‑range buckets with filters.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DocumentsByCategoryPieCard.tsx": "Renders a pie chart showing document counts grouped by category.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpirationTrendChartCard.tsx": "Shows monthly expiration trends of components using either bar or line charts.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpiredByBenchChartCard.tsx": "Charts top benches by expired component count using bar or line visualization.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/HealthGaugeCard.tsx": "Displays overall component health by calculating status counts and showing percentage bars and totals.",
  "frontend/src/pages/Dashboard/components/StatisticsSection.tsx": "Renders a customizable, reorderable set of statistic and chart cards summarizing bench and component data.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard assembly that loads benches, components, documents, computes expiration statuses, and renders sections with reordering.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page handling personal info, thresholds, avatar selection, and bench-specific settings.",
  "frontend/src/pages/SignInPage.tsx": "Sign-in screen using Internet Identity with status handling and simple UI messaging.",
  "frontend/src/utils/avatars.ts": "Maps avatar IDs to asset paths and provides helpers to retrieve avatar paths and IDs.",
  "frontend/src/utils/blobUpload.ts": "Uploads a file as an ExternalBlob with optional progress tracking.",
  "frontend/src/utils/defaultBenchPhoto.ts": "Fetches and converts a default bench photo into an ExternalBlob.",
  "frontend/src/utils/download.ts": "Downloads a document stored as an ExternalBlob by converting bytes into a downloadable file.",
  "frontend/src/utils/expirationSettings.ts": "Manages expiration thresholds and computes component expiration statuses based on profile settings.",
  "frontend/src/utils/id.ts": "Generates simple unique IDs using timestamps and random strings.",
  "frontend/src/utils/rewriteDescription.ts": "Cleans and normalizes description text by fixing whitespace, capitalization, punctuation, and standard abbreviations.",
  "frontend/src/utils/search.ts": "Filters benches by checking whether all query terms appear in their combined searchable fields.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL params, persisting them in sessionStorage, and managing hash-based routing behavior.",
  "frontend/src/utils/validation.ts": "Includes validators for email, domain-restricted email, AGILE codes, semantic versions, and URLs.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins including typography and container queries.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related build files, enabling ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Sets up Vite with React, env injection, path aliases, dev server proxy, and build output settings.",
  "project_state.json": "Stores project metadata, feature definitions, and pending requests related to component duplication workflows."
}