{
  "backend/main.mo": "Main backend actor defining types, maps, and storage/authorization mixins for users, benches, documents, components, and history.",
  "backend/migration.mo": "Migration module containing legacy type definitions and a no-op migration function returning the previous actor state.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend files for documentation or tooling use.",
  "frontend/DEPLOYMENT_PRODUCTION_DRAFT_V36.md": "Production deployment checklist for Draft Version 36 with environment, build, and backend verification steps.",
  "frontend/DEPLOYMENT_PRODUCTION_DRAFT_V47.md": "Production deployment checklist for Draft Version 47 outlining environment validation and build/deploy steps.",
  "frontend/DEPLOYMENT_PRODUCTION_DRAFT_V48.md": "Production deployment checklist for Draft Version 48 describing prerequisites and required environment variables.",
  "frontend/index.css": "Tailwind configuration with custom CSS variables defining themes, colors, and global styles.",
  "frontend/index.html": "Basic HTML entry point that loads the app root and main TypeScript bundle.",
  "frontend/README_PRODUCTION_ENV.md": "Documentation of required production environment variables for the frontend, including canister IDs and II configuration.",
  "frontend/SMOKE_TEST_PRODUCTION_DRAFT_V36.md": "Smoke test script for version 36 covering sign‑in, protected routes, and profile setup persistence.",
  "frontend/SMOKE_TEST_PRODUCTION_DRAFT_V47.md": "Updated version 47 smoke test with steps for authentication, navigation, and profile setup validation.",
  "frontend/SMOKE_TEST_PRODUCTION_DRAFT_V48.md": "More detailed version 48 smoke test including diagnostics, authentication, and profile persistence checks.",
  "frontend/SMOKE_TEST_PRODUCTION_RESULTS_V36.md": "Template for recording smoke test results for version 36, including sign‑in outcomes and notes.",
  "frontend/SMOKE_TEST_PRODUCTION_RESULTS_V47.md": "Results template for version 47 smoke tests with fields for status and console errors.",
  "frontend/SMOKE_TEST_PRODUCTION_RESULTS_V48.md": "Version 48 smoke test results template with structured sections for each test area.",
  "frontend/src/App.tsx": "Sets up routing, providers, and layout logic including separate public and protected route trees.",
  "frontend/src/components/admin/AdminGate.tsx": "Permission gate component that checks admin status and blocks access with alerts if unauthorized.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that displays an alert and allows reloading when errors occur.",
  "frontend/src/components/auth/ActorGate.tsx": "Wraps children and blocks rendering until the backend actor is loaded, showing loading or error states.",
  "frontend/src/components/auth/AuthGate.tsx": "Ensures the user is authenticated via Internet Identity, redirecting or prompting sign‑in when needed.",
  "frontend/src/components/dnd/DraggableList.tsx": "Renders a draggable list UI with customizable items and visual drag feedback.",
  "frontend/src/components/dnd/useDraggableOrder.ts": "Provides state and handlers for reordering items via drag‑and‑drop.",
  "frontend/src/components/export/ExportDialog.tsx": "Implements a dialog for exporting data with options for scope, format, filters, and BenchExpert ZIP logic.",
  "frontend/src/components/layout/AppShell.tsx": "Top‑level layout with navigation, theme toggle, user menu, and export dialog launcher.",
  "frontend/src/components/navigation/ScrollShortcuts.tsx": "Shows floating buttons to scroll to top or bottom based on current scroll position.",
  "frontend/src/components/profile/EntityTagInput.tsx": "Single‑value entity tag input with suggestions, add/remove behavior, and validation.",
  "frontend/src/components/profile/PredefinedAvatarPicker.tsx": "Displays a grid of predefined avatar options and allows selecting one.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user avatar from predefined or custom images with cache‑busting support.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Toggles between light and dark themes using next‑themes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useAvatarCacheBuster.ts": "Provides a store for forcing avatar reloads by updating a timestamp-based cache buster.",
  "frontend/src/hooks/useDashboardChartType.ts": "Stores and persists the user’s selected dashboard chart type in localStorage.",
  "frontend/src/hooks/useExportDialogData.ts": "Fetches all test benches and unique component names for export dialogs using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity state, login, and logout functions.",
  "frontend/src/hooks/useLastSeenHeartbeat.ts": "Periodically updates the user’s last-seen timestamp on the backend when authenticated.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating test benches, profiles, and related backend data.",
  "frontend/src/i18n/I18nProvider.tsx": "Loads, stores, and persists the current language, syncing with backend when authenticated.",
  "frontend/src/i18n/languages.ts": "Defines supported languages and helpers for validating and retrieving language names and flags.",
  "frontend/src/i18n/translations.ts": "Contains translation dictionaries for supported languages, primarily English in this file segment.",
  "frontend/src/i18n/useI18n.ts": "Provides translation access with fallback logic and a helper for humanized keys.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme CSS variables and applying base styles.",
  "frontend/src/main.tsx": "Entrypoint rendering the React app with query client and Internet Identity provider.",
  "frontend/src/pages/Admin/AdminPage.tsx": "Admin dashboard page with tabs for benches, documents, and users using i18n labels.",
  "frontend/src/pages/Admin/components/AdminBenchesPanel.tsx": "Lists all benches with delete actions, loading state, and a confirmation dialog.",
  "frontend/src/pages/Admin/components/AdminDocumentsPanel.tsx": "Displays documents with bench associations and supports downloading them.",
  "frontend/src/pages/Admin/components/AdminUsersPanel.tsx": "Shows the current user's profile details and preference settings.",
  "frontend/src/pages/Benches/BenchDetailPage.tsx": "Bench detail view allowing edits, component management, history viewing, and delete actions.",
  "frontend/src/pages/Benches/BenchListPage.tsx": "Lists benches with search and add‑bench modal, handling loading and empty states.",
  "frontend/src/pages/Benches/components/AddBenchModal.tsx": "Modal form for creating a test bench with fields, validation, photo upload, tags, documents, components, and optional duplication to other benches.",
  "frontend/src/pages/Benches/components/BenchComponentsTableEditor.tsx": "Editor table for adding, editing, removing, and evaluating component expiration status for a bench.",
  "frontend/src/pages/Benches/components/BenchDocumentsEditor.tsx": "Manages bench documents, including loading, uploading, editing, duplicating, deleting, and associating documents to a bench.",
  "frontend/src/pages/Benches/components/BenchHistoryList.tsx": "Displays chronological history entries for a bench with timestamps, user info, and optional details.",
  "frontend/src/pages/Benches/components/BenchPhoto.tsx": "Renders a bench photo with loading and error fallback behavior using an ExternalBlob URL.",
  "frontend/src/pages/Benches/components/DocumentCategoriesInput.tsx": "Allows selecting document categories and attaching versioned files per category for bench creation.",
  "frontend/src/pages/Benches/components/DuplicateComponentDialog.tsx": "Dialog allowing users to select benches and duplicate a component to multiple destinations, with validation and success/error handling.",
  "frontend/src/pages/Benches/components/DuplicateDocumentDialog.tsx": "Dialog for duplicating a document to other benches that don't already have it, handling selection, API calls, and toast messaging.",
  "frontend/src/pages/Benches/components/EditBenchDocumentDialog.tsx": "Dialog to edit a bench document’s metadata and optionally replace its file, including upload progress and form validation.",
  "frontend/src/pages/Benches/components/EditBenchModal.tsx": "Modal for editing bench details such as name, URLs, description, tags, and photo, with validation and file upload support.",
  "frontend/src/pages/Benches/components/MoveComponentDialog.tsx": "Dialog enabling users to move a component from the current bench to a selected destination bench with API integration and error handling.",
  "frontend/src/pages/Benches/components/TagsInput.tsx": "A tag input component that lets users add, remove, and pick from suggested tags with keyboard support and a popover selector.",
  "frontend/src/pages/Benches/NewBenchPage.tsx": "Static placeholder page showing planned features for creating a new test bench, including photo upload, metadata fields, tags, and document attachments.",
  "frontend/src/pages/Dashboard/components/MovementFlowSection.tsx": "Processes movement history to aggregate bench-to-bench transfers and displays them as ranked flow rows with counts and progress bars.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ComponentsByStatusPieCard.tsx": "Computes expiration status counts across benches and renders them as a pie chart showing OK, expiring soon, and expired components.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/CriticalityChartCard.tsx": "Builds per-bench expiration status counts and displays them in a bar chart grouped by OK, expiring soon, and expired.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DeadlineChartCard.tsx": "Groups components by expiration date ranges and visualizes the distribution in a bar chart.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DocumentsByCategoryPieCard.tsx": "Counts documents by category and displays the distribution as a pie chart with category-based colors.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpirationTrendChartCard.tsx": "Aggregates components by expiration month and visualizes the trend as either a bar or line chart.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpiredByBenchChartCard.tsx": "Computes expired component counts per bench and displays them in either a bar or line chart with i18n text and empty‑state handling.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/HealthGaugeCard.tsx": "Aggregates component expiration statuses and shows percentages using progress bars to visualize overall bench health.",
  "frontend/src/pages/Dashboard/components/StatisticsSection.tsx": "Defines a draggable list of dashboard statistic cards, prepares bench data, and renders various chart components based on saved order.",
  "frontend/src/pages/DashboardPage.tsx": "Loads benches, components, documents, and history from the backend, enables section reordering, and renders the main dashboard sections.",
  "frontend/src/pages/ProfilePage.tsx": "Provides a full user profile editor including personal info, avatar, language, and expiration‑threshold settings with backend persistence.",
  "frontend/src/pages/SignInPage.tsx": "Displays the login screen using Internet Identity, handles errors, and redirects authenticated users to the dashboard.",
  "frontend/src/pages/Users/UserProfileDetailsPage.tsx": "Displays a user profile by principal ID, handling invalid IDs, loading states, errors, and rendering profile details.",
  "frontend/src/utils/avatars.ts": "Provides a map of avatar IDs to image paths and helpers to retrieve avatar paths and IDs.",
  "frontend/src/utils/blobUpload.ts": "Uploads a file as an ExternalBlob with optional progress tracking.",
  "frontend/src/utils/defaultBenchPhoto.ts": "Fetches and converts a default bench placeholder image into an ExternalBlob.",
  "frontend/src/utils/download.ts": "Downloads files from ExternalBlob references or raw blobs by triggering browser downloads.",
  "frontend/src/utils/errors.ts": "Normalizes various error types into user-friendly messages with specific backend mappings.",
  "frontend/src/utils/expirationSettings.ts": "Manages expiration-threshold settings, combining localStorage defaults with user profile overrides and computing expiration status.",
  "frontend/src/utils/export/benchExpertZip.ts": "Generates a text-based bench expert export for selected benches and triggers download as a .txt file.",
  "frontend/src/utils/export/exportFilters.ts": "Filters benches, components, and history from export payloads based on user-selected options and scope.",
  "frontend/src/utils/export/exportGenerators.ts": "Provides functions to export filtered data as CSV, TXT, or SQLite, assembling formatted content and triggering file downloads.",
  "frontend/src/utils/export/sqliteExport.ts": "Dynamically loads sql.js and builds a SQLite database containing benches, components, and history data for export.",
  "frontend/src/utils/id.ts": "Generates a unique ID using a timestamp and random string.",
  "frontend/src/utils/rewriteDescription.ts": "Cleans and normalizes bench descriptions by fixing whitespace, capitalization, punctuation, and common abbreviations.",
  "frontend/src/utils/search.ts": "Searches benches by matching query terms against bench fields and tags.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/validation.ts": "Provides input validation for emails, AGILE codes, semantic versions, and URLs.",
  "frontend/tailwind.config.js": "Configures TailwindCSS themes, colors, typography, container queries, animations, and plugin setup.",
  "frontend/tsconfig.node.json": "Defines TypeScript config for Node-focused build files with ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Configures Vite with React, environment variable injection, aliasing, dev server proxying, and build settings.",
  "project_state.json": "Defines project state, listing existing features, pending requests, and a primary issue about broken site translation, plus enhancements for document management, dashboard views, and data export."
}