{
  "backend/main.mo": "Defines backend actor state, data types, and maps for users, benches, documents, components, tags, and history, including access control and storage mixins.",
  "feature_evidence.json": "Lists feature evidence entries describing deployment and smoke‑test tasks, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for many frontend source files describing their purpose and behavior.",
  "frontend/DEPLOYMENT_PRODUCTION_DRAFT_V36.md": "Provides the production deployment checklist for Draft Version 36, including environment validation and build steps.",
  "frontend/index.css": "Defines global Tailwind styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Minimal HTML entry point loading the React application via main.tsx.",
  "frontend/README_PRODUCTION_ENV.md": "Documents required production environment variables for the frontend, including canister IDs and Internet Identity configuration.",
  "frontend/SMOKE_TEST_PRODUCTION_DRAFT_V36.md": "Outlines the smoke test procedure for validating sign‑in, protected routing, and profile persistence after production deployment.",
  "frontend/src/App.tsx": "Main application router setup with separate public and protected route trees, global providers, and AppShell wrapping protected pages.",
  "frontend/src/components/admin/AdminGate.tsx": "Protects admin-only content by checking admin status and showing loaders or access-denied alerts.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches rendering errors and displays a reload prompt.",
  "frontend/src/components/auth/ActorGate.tsx": "Ensures a backend actor is available, showing loading or connection error states before rendering children.",
  "frontend/src/components/auth/AuthGate.tsx": "Handles authentication gating, redirecting to sign-in and showing login prompts when identity is missing.",
  "frontend/src/components/dnd/DraggableList.tsx": "Generic draggable list component enabling item reordering with visual drag cues.",
  "frontend/src/components/dnd/useDraggableOrder.ts": "Hook managing drag-and-drop item order state and handlers.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout with navigation, user menu, theme toggle, and admin-aware links.",
  "frontend/src/components/navigation/ScrollShortcuts.tsx": "Shows scroll-to-top and scroll-to-bottom buttons based on scroll position.",
  "frontend/src/components/profile/EntityTagInput.tsx": "Single-value tag input supporting suggestions, keyboard actions, and removable selection.",
  "frontend/src/components/profile/PredefinedAvatarPicker.tsx": "Grid selector for picking from predefined avatar images.",
  "frontend/src/components/profile/UserAvatar.tsx": "Displays user avatar from predefined or custom sources with cache-busting and size options.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Button toggling between light and dark themes using next-themes.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useAvatarCacheBuster.ts": "Provides a store with a numeric cache-buster for avatar URLs and a method to refresh it.",
  "frontend/src/hooks/useDashboardChartType.ts": "Stores and persists the user's selected dashboard chart type in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, loading, login, logout, and identity persistence.",
  "frontend/src/hooks/useLastSeenHeartbeat.ts": "Periodically calls the backend to update the authenticated user's last-seen timestamp.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks wrapping backend calls for benches, profiles, preferences, and related mutations.",
  "frontend/src/i18n/I18nProvider.tsx": "Manages language selection, loads preference from backend or localStorage, and exposes it via context.",
  "frontend/src/i18n/languages.ts": "Defines supported languages and helpers to validate, name, and display language flags.",
  "frontend/src/i18n/translations.ts": "Lists all translation keys used throughout the app for localization.",
  "frontend/src/i18n/useI18n.ts": "Provides translation lookup and language control via the I18n context.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables for colors and layout, applying base background and text styles.",
  "frontend/src/main.tsx": "Initializes React root, sets up React Query and Internet Identity provider, and renders the main App.",
  "frontend/src/pages/Admin/AdminPage.tsx": "Provides the main admin interface with tabs for benches, documents, and users, using translation strings and UI components.",
  "frontend/src/pages/Admin/components/AdminBenchesPanel.tsx": "Displays all test benches with delete functionality, including confirmation dialogs and loading states.",
  "frontend/src/pages/Admin/components/AdminDocumentsPanel.tsx": "Lists documents with metadata and provides download handling with success/error toasts and loading state.",
  "frontend/src/pages/Admin/components/AdminUsersPanel.tsx": "Shows the current user profile with expiration preferences and dashboard layout info, handling loading and missing data.",
  "frontend/src/pages/Benches/BenchDetailPage.tsx": "Shows detailed bench info with editing, removal, component management, duplication, and history features.",
  "frontend/src/pages/Benches/BenchListPage.tsx": "Displays a searchable list of benches with add‑bench modal and loading/empty‑state handling.",
  "frontend/src/pages/Benches/components/AddBenchModal.tsx": "Implements a modal form to create a new test bench with fields, validation, uploads, tags, components, and duplication options.",
  "frontend/src/pages/Benches/components/BenchComponentsTableEditor.tsx": "Provides a table editor for adding, editing, and removing bench components with expiration status handling.",
  "frontend/src/pages/Benches/components/BenchDocumentsEditor.tsx": "Allows uploading, listing, downloading, versioning, and deleting documents associated with a bench.",
  "frontend/src/pages/Benches/components/BenchHistoryList.tsx": "Renders a chronological list of bench history entries with user info and timestamps.",
  "frontend/src/pages/Benches/components/BenchPhoto.tsx": "Displays a bench photo with loading and error fallbacks.",
  "frontend/src/pages/Benches/components/DocumentCategoriesInput.tsx": "Lets users manage document categories and attach files with version metadata.",
  "frontend/src/pages/Benches/components/DuplicateComponentDialog.tsx": "Dialog for selecting benches and duplicating a component via mutation and toast feedback.",
  "frontend/src/pages/Benches/components/EditBenchModal.tsx": "Modal for editing bench details, validating fields, updating photos, and submitting updates via mutation.",
  "frontend/src/pages/Benches/components/TagsInput.tsx": "Tag entry component allowing adding, removing, and selecting tag suggestions with filtering.",
  "frontend/src/pages/Benches/NewBenchPage.tsx": "Displays a placeholder page for creating a new bench, showing an alert and planned feature list.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ComponentsByStatusPieCard.tsx": "Pie chart card showing counts of components by expiration status using thresholds and i18n labels.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/CriticalityChartCard.tsx": "Bar chart comparing component expiration status per bench with dynamic thresholds and i18n.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DeadlineChartCard.tsx": "Bar chart grouping components by expiration date ranges to show upcoming deadlines.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DocumentsByCategoryPieCard.tsx": "Pie chart summarizing documents by category with color coding and i18n labels.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpirationTrendChartCard.tsx": "Builds a bar or line chart showing component expirations grouped by month using Recharts, displaying a no‑data state when empty.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpiredByBenchChartCard.tsx": "Calculates expired components per bench based on profile thresholds and renders the result as a bar or line chart.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/HealthGaugeCard.tsx": "Computes overall component health distribution and displays percentages in a gauge-like set of progress bars.",
  "frontend/src/pages/Dashboard/components/StatisticsSection.tsx": "Defines a draggable, persistent list of statistic and chart cards for the dashboard’s summary section.",
  "frontend/src/pages/DashboardPage.tsx": "Assembles the main dashboard, fetching data, computing component statuses, managing section order, and rendering charts and tables.",
  "frontend/src/pages/ProfilePage.tsx": "Implements the user profile editor, including personal info, thresholds, avatar selection, language settings, and validation.",
  "frontend/src/pages/SignInPage.tsx": "Sign-in page using Internet Identity with redirect on success and error display. Renders logo, login button, and helper text.",
  "frontend/src/utils/avatars.ts": "Maps avatar IDs to image paths and provides helpers to retrieve paths and list all IDs.",
  "frontend/src/utils/blobUpload.ts": "Uploads a File as an ExternalBlob with optional progress tracking.",
  "frontend/src/utils/defaultBenchPhoto.ts": "Fetches and returns the default bench placeholder image as an ExternalBlob.",
  "frontend/src/utils/download.ts": "Retrieves bytes from an ExternalBlob and triggers a file download in the browser.",
  "frontend/src/utils/errors.ts": "Normalizes various error types into readable messages with special handling for backend traps.",
  "frontend/src/utils/expirationSettings.ts": "Manages expiration threshold settings with localStorage fallback and computes expiration status.",
  "frontend/src/utils/id.ts": "Generates a simple unique ID using timestamp and random string.",
  "frontend/src/utils/rewriteDescription.ts": "Deterministically cleans and normalizes bench description text, fixing casing, spacing, and abbreviations.",
  "frontend/src/utils/search.ts": "Searches test benches by matching query terms against multiple bench fields.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, supporting hash routing.",
  "frontend/src/utils/validation.ts": "Validates emails, domains, AGILE codes, semantic versions, and URLs.",
  "frontend/tailwind.config.js": "Tailwind configuration defining colors, themes, plugins, animations, and content paths.",
  "frontend/tsconfig.node.json": "TypeScript config for node build tools with ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Vite config enabling React, env injection, path aliasing, dev proxy, and build output settings.",
  "project_state.json": "Tracks project state for deploying Draft Version 36, including approved deployment details and smoke-test requirements. Lists existing features, no new requests, and notes profile persistence and login behavior updates."
}