{
  "backend/main.mo": "Defines the main canister actor with authorization, blob storage mixins, data types (documents, benches, components, users), and initial query methods for test bench access with permission checks.",
  "feature_evidence.json": "Feature evidence report listing implemented features, impacted files, components, and associated test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their roles in routing, UI, profile handling, validation, and data fetching.",
  "frontend/index.css": "Global Tailwind-based style definitions using OKLCH color variables for light and dark themes and base element styling.",
  "frontend/index.html": "Basic HTML entry point containing the root mount node and script loading the main React application.",
  "frontend/src/App.tsx": "Sets up TanStack Router with protected routes wrapped in AuthGate and ActorGate, theme provider, and global error boundary.",
  "frontend/src/components/admin/AdminGate.tsx": "Empty file placeholder for admin access control component.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches runtime errors and displays a reloadable error UI.",
  "frontend/src/components/auth/ActorGate.tsx": "Ensures backend actor initialization before rendering protected content, showing loading or error states as needed.",
  "frontend/src/components/auth/AuthGate.tsx": "Blocks access to protected content until Internet Identity authentication is complete, with loading and error messaging.",
  "frontend/src/components/dnd/DraggableList.tsx": "Generic draggable list component enabling drag-and-drop reordering with visual feedback.",
  "frontend/src/components/dnd/useDraggableOrder.ts": "React hook managing drag-and-drop ordering state and logic for lists.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper with navigation, theme toggle, logout handling, and scroll shortcuts; renders child routes via Outlet.",
  "frontend/src/components/navigation/ScrollShortcuts.tsx": "Shows scroll-to-top and scroll-to-bottom buttons based on scroll position and performs smooth scrolling.",
  "frontend/src/components/profile/EntityTagInput.tsx": "Single-value tag input with add/remove behavior, suggestion dropdown, and basic validation handling.",
  "frontend/src/components/profile/PredefinedAvatarPicker.tsx": "Grid selector for predefined avatar images with visual highlighting and click-to-select behavior.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user avatar from predefined or custom sources with cache-busting and size options.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useAvatarCacheBuster.ts": "Zustand store generating a timestamp used to force cache refreshes for avatar URLs.",
  "frontend/src/hooks/useDashboardChartType.ts": "Stores and persists the selected dashboard chart type in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, login, logout, and status tracking.",
  "frontend/src/hooks/useLastSeenHeartbeat.ts": "Periodic heartbeat hook that updates the user's last-seen timestamp via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping actor calls for fetching and mutating test benches, user profiles, roles, settings, and related data.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and applying global base styles.",
  "frontend/src/main.tsx": "App bootstrap that configures React Query and Internet Identity providers before rendering the root App component.",
  "frontend/src/pages/Admin/AdminPage.tsx": "Empty admin page placeholder.",
  "frontend/src/pages/Admin/components/AdminBenchesPanel.tsx": "Empty admin benches panel placeholder.",
  "frontend/src/pages/Admin/components/AdminDocumentsPanel.tsx": "Empty admin documents panel placeholder.",
  "frontend/src/pages/Admin/components/AdminUsersPanel.tsx": "Empty admin users panel placeholder.",
  "frontend/src/pages/Benches/BenchDetailPage.tsx": "Displays detailed information for a specific test bench and supports editing, component management, history viewing, and deletion.",
  "frontend/src/pages/Benches/BenchListPage.tsx": "Lists all test benches with search, filtering, navigation, and a modal to add new benches.",
  "frontend/src/pages/Benches/components/AddBenchModal.tsx": "Modal form for creating a new test bench with fields for metadata, tags, documents, photo upload, and validation.",
  "frontend/src/pages/Benches/components/BenchComponentsTableEditor.tsx": "Interactive table for adding, editing, and removing bench components while computing expiration status and emitting changes upward.",
  "frontend/src/pages/Benches/components/BenchDocumentsEditor.tsx": "Manages document uploads, versions, associations, and deletions for a bench across predefined categories with progress tracking.",
  "frontend/src/pages/Benches/components/BenchHistoryList.tsx": "Displays a sorted list of bench history entries with user info, timestamps, and optional details.",
  "frontend/src/pages/Benches/components/BenchPhoto.tsx": "Renders a bench photo with loading and error fallbacks using an ExternalBlob URL.",
  "frontend/src/pages/Benches/components/DocumentCategoriesInput.tsx": "Allows selecting document categories and attaching files with version metadata, supporting add/remove operations.",
  "frontend/src/pages/Benches/components/EditBenchModal.tsx": "Modal form for editing bench metadata, photo, tags, and validation before submitting updates.",
  "frontend/src/pages/Benches/components/TagsInput.tsx": "Tag input component enabling free-form tag creation, deletion, and selection from suggestions.",
  "frontend/src/pages/Benches/NewBenchPage.tsx": "Placeholder page describing upcoming features for creating a new test bench.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ComponentsByStatusPieCard.tsx": "Computes component expiration status counts and renders them as a pie chart. Shows OK, expiring soon, and expired distribution across all benches.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/CriticalityChartCard.tsx": "Aggregates component status counts with optional bench filtering and displays them in a bar chart. Visualizes OK, expiring soon, and expired totals.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DeadlineChartCard.tsx": "Buckets components by time-to-expiration based on a selectable range and displays the counts in a bar chart. Supports filtering by bench and multiple time-range presets.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DocumentsByCategoryPieCard.tsx": "Counts documents by category and displays the distribution as a pie chart. Shows category proportions or a fallback message if empty.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpirationTrendChartCard.tsx": "Groups component expirations by month and displays the last 12 months as either a bar or line chart. Handles empty data with a fallback view.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpiredByBenchChartCard.tsx": "Calculates expired component counts per bench and charts the top benches using a bar or line chart. Filters out benches with zero expired components.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/HealthGaugeCard.tsx": "Computes overall OK, expiring soon, and expired percentages and renders progress bars summarizing system-wide component health. Falls back when no components exist.",
  "frontend/src/pages/Dashboard/components/StatisticsSection.tsx": "Renders draggable dashboard statistic and chart cards using saved order from localStorage.",
  "frontend/src/pages/DashboardPage.tsx": "Builds the main dashboard, loading benches, components, documents, computing expiration stats, and supporting section reordering.",
  "frontend/src/pages/ProfilePage.tsx": "Manages user profile editing including thresholds, avatar selection, validation, and saving preferences.",
  "frontend/src/pages/SignInPage.tsx": "Displays login UI using Internet Identity with error handling.",
  "frontend/src/utils/avatars.ts": "Provides avatar ID-to-path mapping utilities.",
  "frontend/src/utils/blobUpload.ts": "Uploads a file as an ExternalBlob with optional progress tracking.",
  "frontend/src/utils/defaultBenchPhoto.ts": "Fetches and converts the default bench placeholder image into an ExternalBlob.",
  "frontend/src/utils/download.ts": "Downloads a document by converting an ExternalBlob to a browser file download.",
  "frontend/src/utils/expirationSettings.ts": "Handles expiration threshold settings and computes component expiration status.",
  "frontend/src/utils/id.ts": "Generates simple unique IDs from timestamps and random data.",
  "frontend/src/utils/rewriteDescription.ts": "Applies heuristic text normalization and formatting to bench descriptions.",
  "frontend/src/utils/search.ts": "Searches test benches by matching query terms against multiple bench fields.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/src/utils/validation.ts": "Contains validation helpers for email, domain-specific email, AGILE codes, semantic versions, and URLs.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, container settings, animations, and plugins.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related tooling, enabling ESNext modules and bundler resolution for vite.config.ts.",
  "frontend/vite.config.ts": "Vite configuration enabling React, environment variables, path aliases, dev server proxying, and build output settings.",
  "project_state.json": "Defines project state, known issues, and feature requests related to entity tag saving and profile photo refresh behavior."
}