{
  "backend/main.mo": "Defines core data types, maps, and authorization-enabled actor methods for managing test benches, documents, components, history, and user profiles.",
  "feature_evidence.json": "Empty feature evidence report structure with no features listed.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files for reference or documentation.",
  "frontend/index.css": "Global Tailwind base and theme variable definitions for light and dark modes using OKLCH color tokens.",
  "frontend/index.html": "Basic HTML entry point mounting the React app at #root and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, global theme provider, authentication-aware routing, and root layout with AppShell and error boundary.",
  "frontend/src/components/admin/AdminGate.tsx": "Empty placeholder file for admin access control component.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches runtime errors and displays a reloadable fallback UI.",
  "frontend/src/components/auth/ActorGate.tsx": "Ensures backend actor availability, showing loading or error states before rendering children.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication guard that blocks access until Internet Identity is initialized and available.",
  "frontend/src/components/dnd/DraggableList.tsx": "Generic draggable list component enabling item reordering through drag-and-drop.",
  "frontend/src/components/dnd/useDraggableOrder.ts": "Hook providing drag-and-drop state management and item reordering logic for lists.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application shell with navigation, theme toggle, logout handling, and responsive headers.",
  "frontend/src/components/navigation/ScrollShortcuts.tsx": "Provides floating buttons to scroll to top or bottom based on scroll position.",
  "frontend/src/components/profile/EntityTagInput.tsx": "Implements a tag-like input for selecting or typing a single entity with suggestions and validation.",
  "frontend/src/components/profile/PredefinedAvatarPicker.tsx": "Renders a grid of predefined avatar options and triggers selection callbacks.",
  "frontend/src/components/profile/UserAvatar.tsx": "Displays a user's avatar from predefined or custom sources with cache-busting support.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAvatarCacheBuster.ts": "Zustand store providing a timestamp-based cache-buster for avatar URLs.",
  "frontend/src/hooks/useDashboardChartType.ts": "Manages persistent dashboard chart type state using localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and helpers for Internet Identity using Dfinity AuthClient.",
  "frontend/src/hooks/useLastSeenHeartbeat.ts": "Periodically calls the backend to update the user's last-seen timestamp when authenticated.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for fetching and mutating benches, users, components, and preferences.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme CSS variables and base styling.",
  "frontend/src/main.tsx": "Application entry point wiring React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/Admin/AdminPage.tsx": "Empty placeholder for the admin page.",
  "frontend/src/pages/Admin/components/AdminBenchesPanel.tsx": "Empty placeholder for an admin benches panel.",
  "frontend/src/pages/Admin/components/AdminDocumentsPanel.tsx": "Empty placeholder for an admin documents panel.",
  "frontend/src/pages/Admin/components/AdminUsersPanel.tsx": "Empty placeholder for an admin users panel.",
  "frontend/src/pages/Benches/BenchDetailPage.tsx": "Displays test bench details with components, documents, history, editing, and deletion actions.",
  "frontend/src/pages/Benches/BenchListPage.tsx": "Lists all test benches with search, filtering, and a modal to add new benches.",
  "frontend/src/pages/Benches/components/AddBenchModal.tsx": "Modal for creating a new test bench with fields, validation, uploads, tags, and component duplication options.",
  "frontend/src/pages/Benches/components/BenchComponentsTableEditor.tsx": "Editable table for adding, modifying, duplicating, and removing bench components with expiration status handling.",
  "frontend/src/pages/Benches/components/BenchDocumentsEditor.tsx": "Manages bench documents by category, supporting upload with progress, versioning, download, and deletion.",
  "frontend/src/pages/Benches/components/BenchHistoryList.tsx": "Displays sorted bench history entries with timestamps, user info, and optional details.",
  "frontend/src/pages/Benches/components/BenchPhoto.tsx": "Renders a bench photo with loading and error states, falling back to a placeholder if needed.",
  "frontend/src/pages/Benches/components/DocumentCategoriesInput.tsx": "Form component for selecting document categories and attaching files with version fields.",
  "frontend/src/pages/Benches/components/DuplicateComponentDialog.tsx": "Dialog for duplicating a component to multiple benches with selection and mutation handling.",
  "frontend/src/pages/Benches/components/EditBenchModal.tsx": "Modal form to edit bench metadata, photo, and tags with validation and update submission.",
  "frontend/src/pages/Benches/components/TagsInput.tsx": "Interactive input for adding, removing, and selecting tag items with suggestion filtering.",
  "frontend/src/pages/Benches/NewBenchPage.tsx": "Static placeholder page describing upcoming bench creation features.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ComponentsByStatusPieCard.tsx": "Builds a pie chart summarizing component health status counts using expiration rules.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/CriticalityChartCard.tsx": "Displays a bar chart of component status counts with optional bench filtering.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DeadlineChartCard.tsx": "Generates a bar chart grouping components into time-to-expiration buckets with bench and range filters.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DocumentsByCategoryPieCard.tsx": "Renders a pie chart showing document counts grouped by category.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpirationTrendChartCard.tsx": "Charts monthly expiration counts over time using either bar or line mode.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/ExpiredByBenchChartCard.tsx": "Shows a bar or line chart of benches ranked by number of expired components.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/HealthGaugeCard.tsx": "Renders a health gauge card summarizing component statuses (ok, expiring soon, expired) with progress bars. Computes percentages from provided bench component data.",
  "frontend/src/pages/Dashboard/components/StatisticsSection.tsx": "Displays draggable dashboard statistic and chart cards, initializing order from localStorage. Includes stat cards and criticality/deadline charts based on bench data.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page fetching benches, components, documents, and user profile to compute statuses and render sections. Supports customizable section ordering and document downloads.",
  "frontend/src/pages/ProfilePage.tsx": "Profile management page allowing users to edit personal info, expiration thresholds, avatar, and custom photos. Loads and saves profile data, permissions, and test bench settings.",
  "frontend/src/pages/SignInPage.tsx": "Simple sign‑in page using Internet Identity with branding and error handling. Provides a button to trigger login and displays status messages.",
  "frontend/src/utils/avatars.ts": "Maps avatar IDs to asset paths and provides helpers to get avatar paths and list available avatar IDs.",
  "frontend/src/utils/blobUpload.ts": "Uploads a file as an ExternalBlob with optional progress tracking. Converts file bytes and attaches progress callback if provided.",
  "frontend/src/utils/defaultBenchPhoto.ts": "Fetches and returns a default bench photo as an ExternalBlob. Loads image bytes from a predefined asset path with error handling.",
  "frontend/src/utils/download.ts": "Downloads an ExternalBlob as a file by generating a temporary URL and triggering browser download. Handles byte extraction and cleanup.",
  "frontend/src/utils/expirationSettings.ts": "Manages expiration threshold settings with localStorage fallback and profile-based overrides. Provides helper to compute component expiration status.",
  "frontend/src/utils/id.ts": "Generates a simple unique ID using timestamp and random string.",
  "frontend/src/utils/rewriteDescription.ts": "Provides a deterministic client-side text cleanup function that normalizes spacing, capitalization, punctuation, and common abbreviations.",
  "frontend/src/utils/search.ts": "Implements simple keyword-based search over test benches by matching query terms against multiple bench fields.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, clearing, and persisting URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/validation.ts": "Contains validation helpers for emails, domain-restricted emails, AGILE codes, semantic versions, and URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and layout settings with custom plugins.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related build files, enabling ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Vite configuration enabling React, environment variable injection, path aliasing, dev server proxying, and build settings.",
  "project_state.json": "Project state file describing architecture notes, known issues, and a pending fix request for real-time Health Book updates after component moves."
}