{
  "backend/main.mo": "Main Motoko canister defining data types, maps, authorization mixins, and query methods for benches, documents, components, history, and user profiles.",
  "backend/migration.mo": "Migration module converting old user profile data to the new schema with entity, profile picture, and lastSeen fields while preserving other state maps.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the role of each frontend file, including pages, hooks, utilities, and UI components.",
  "frontend/index.css": "Tailwind base styles defining OKLCH theme variables for light and dark modes and applying global background and text settings.",
  "frontend/index.html": "Root HTML file setting up the HistoryBench app container and loading the main React entrypoint.",
  "frontend/src/App.tsx": "Sets up TanStack Router, authentication‑aware root layout, protected routes, theme provider, and global toasts for the React app.",
  "frontend/src/components/admin/AdminGate.tsx": "Admin-only guard component that checks caller role and blocks access with an error message when not an admin.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary component that catches runtime errors and displays a reload prompt.",
  "frontend/src/components/auth/AuthGate.tsx": "Gates child components behind Internet Identity, showing loading or auth-required messages when needed.",
  "frontend/src/components/dnd/DraggableList.tsx": "Renders a draggable item list with visual feedback and calls handlers for drag events and reorder logic.",
  "frontend/src/components/dnd/useDraggableOrder.ts": "Hook managing item order during drag-and-drop, updating list state and tracking the dragged index.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout with navigation, theme toggle, role-based links, and logout handling.",
  "frontend/src/components/navigation/ScrollShortcuts.tsx": "Displays scroll-to-top and scroll-to-bottom buttons based on scroll position.",
  "frontend/src/components/profile/PredefinedAvatarPicker.tsx": "Grid selector for choosing one of several predefined avatar images.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identity, handling login/logout, and tracking status.",
  "frontend/src/hooks/useLastSeenHeartbeat.ts": "Periodically updates the user's last-seen timestamp via the actor when authenticated.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping actor calls for test benches, profiles, roles, and related mutations.",
  "frontend/src/index.css": "Configures Tailwind layers and defines extensive CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and the Internet Identity provider.",
  "frontend/src/pages/Admin/AdminPage.tsx": "Admin dashboard page that displays panels for benches, documents, and users behind an admin gate.",
  "frontend/src/pages/Admin/components/AdminBenchesPanel.tsx": "Displays all test benches with loading state and supports deleting benches via confirmation dialog.",
  "frontend/src/pages/Admin/components/AdminDocumentsPanel.tsx": "Lists all documents and allows downloading them, with loading state handling.",
  "frontend/src/pages/Admin/components/AdminUsersPanel.tsx": "Shows the current user profile and expiration settings, with loading and empty states.",
  "frontend/src/pages/Benches/BenchDetailPage.tsx": "Displays detailed information for a single test bench, including components, documents, history, and edit/remove actions.",
  "frontend/src/pages/Benches/BenchListPage.tsx": "Shows a searchable list of test benches with an option to add new benches and view details.",
  "frontend/src/pages/Benches/components/AddBenchModal.tsx": "Modal form for creating a new bench with validation, photo upload, tags, documents, and component editing.",
  "frontend/src/pages/Benches/components/BenchComponentsTableEditor.tsx": "Editor table for adding, editing, and removing bench components with expiration status calculation.",
  "frontend/src/pages/Benches/components/BenchDocumentsEditor.tsx": "Handles uploading, listing, downloading, and removing documents associated with a bench.",
  "frontend/src/pages/Benches/components/BenchHistoryList.tsx": "Displays chronological bench history entries with timestamps, user info, and optional details.",
  "frontend/src/pages/Benches/components/BenchPhoto.tsx": "Renders a bench photo with loading and error fallback handling.",
  "frontend/src/pages/Benches/components/DocumentCategoriesInput.tsx": "Manages document categories and file uploads for each category with version input and removal controls.",
  "frontend/src/pages/Benches/components/EditBenchModal.tsx": "Modal form for editing a test bench, including validation, photo upload/preview, tag editing, and submitting updates via a mutation.",
  "frontend/src/pages/Benches/components/TagsInput.tsx": "Interactive tag input component allowing adding, removing, and selecting from suggestions with keyboard support.",
  "frontend/src/pages/Benches/NewBenchPage.tsx": "Static page showing a coming-soon notice for creating a new bench and listing planned form features.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/CriticalityChartCard.tsx": "Renders a bar chart summarizing component status counts with optional filtering by bench.",
  "frontend/src/pages/Dashboard/components/StatisticsCharts/DeadlineChartCard.tsx": "Displays a deadline-distribution bar chart for component expiration buckets with bench and time-range filters.",
  "frontend/src/pages/Dashboard/components/StatisticsSection.tsx": "Builds a reorderable statistics section containing stat cards and charts, persisting layout order in local storage.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page fetching benches, components, and documents, computing expiration statuses, and rendering configurable sections.",
  "frontend/src/pages/ProfilePage.tsx": "Profile settings page handling user info, expiration preferences, and avatar selection, integrating multiple backend queries and mutations. Initializes form state from the profile and manages custom or predefined profile pictures.",
  "frontend/src/pages/SignInPage.tsx": "Sign‑in UI using Internet Identity login, showing errors and a simple authentication button. Displays a branded card with status messaging.",
  "frontend/src/utils/download.ts": "Utility to download files from an ExternalBlob by fetching bytes and triggering a browser download. Handles temporary URL creation and cleanup.",
  "frontend/src/utils/expirationSettings.ts": "Utilities for expiration thresholds, including localStorage fallback, bench‑specific overrides, and computing expiration status. Provides global and customized threshold resolution.",
  "frontend/src/utils/id.ts": "Generates a simple unique ID using a timestamp and random string.",
  "frontend/src/utils/rewriteDescription.ts": "Heuristic text cleanup for bench descriptions, normalizing whitespace, capitalization, punctuation, and common abbreviations.",
  "frontend/src/utils/search.ts": "Search function filtering test benches by matching query terms across name, code, description, and tags.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and persisting URL parameters, including sessionStorage integration and hash‑based routing support.",
  "frontend/src/utils/validation.ts": "Validation helpers for email, domain‑restricted email, AGILE codes, semantic versions, and URLs.",
  "frontend/tailwind.config.js": "TailwindCSS configuration with extended theme colors, typography, animations, and plugin setup for container queries and animations.",
  "project_state.json": "Holds project metadata, current feature set, and known issues, including UI enhancements, admin tools, and layout management. Marks the project as a fix request and lists configured features with IDs and versions."
}