{
  "kind": "build_request",
  "title": "Fix Add Bench localization and add RU/ZH/JA/TR UI languages",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the entire \"Add bench\" flow is localized when opened (the modal opened from the Benches list \"Add new\" button), by replacing all user-facing strings in `frontend/src/pages/Benches/components/AddBenchModal.tsx` with `useI18n().t(...)` calls and adding any missing translation keys.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Quand je clique sur Ajouter banc je veux aussi que la page soit traduite."
        ]
      },
      "acceptanceCriteria": [
        "With a non-English language selected, opening the Add Bench modal shows translated UI for: title/description, all field labels, placeholders, helper texts, validation errors, button labels, loading/uploading text, and toast messages.",
        "The Add Bench modal contains no hardcoded English/French UI strings except for non-user-facing/internal values (e.g., IDs).",
        "If a translation key is missing for the active language, the UI does not crash (it may fall back to showing the key, consistent with the current i18n behavior)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add support for additional UI languages (Russian, Simplified Chinese, Japanese, Turkish) by extending `frontend/src/i18n/languages.ts` with language tags and display names, and extending `frontend/src/i18n/translations.ts` to include translation dictionaries for the new languages for all existing `TranslationKey` entries (plus any new keys added for the Add Bench modal).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Pense enfin a rajouter plus de langues comme le russe, le chinois, le japonais et le turc"
        ]
      },
      "acceptanceCriteria": [
        "The language selector (Profile page) shows the newly supported languages and allows selecting them without warnings about unsupported languages.",
        "For each new language tag, `translations[tag]` exists and contains values for all `TranslationKey` entries used by the app (including new Add Bench keys), so the UI does not display raw keys for common screens (Dashboard, Benches list, Bench details, Profile, Admin).",
        "User language choice continues to persist via existing `actor.setLanguageTag` / `actor.getLanguageTag` behavior (no backend changes required)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (compose existing UI components instead).",
    "Do not edit files listed in `frontend.immutablePaths` in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implementing automatic language detection from the browser/device.",
    "Adding right-to-left (RTL) layout support.",
    "Changing backend storage schema for language preferences."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}