{
  "kind": "build_request",
  "title": "Allow duplicating a component to other existing benches during creation and after creation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add backend support to duplicate an existing component into one or more target benches without requiring the user to recreate it from scratch.\n\nImplementation scope:\n- Add a new shared method that takes a `Component` payload and a list of `targetBenchIds`.\n- For each `targetBenchId`, validate the bench exists, then append a copied component into that bench’s component list in `componentMap`.\n- Ensure the copied component’s `associatedBenchId` is set to the target bench ID (not the source bench).\n- Write a history entry for each target bench indicating a component was duplicated into it.\n- Enforce the same authorization checks as existing component management methods.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Lors de la création d'un composants, j'aimerai avoir un bouton qui permet d'etendre ce même composants à d'autres bancq deja existants... ajouter un toggle \"copier ou dupliquer\" qui permet de duplqier ce composants et le réaffecter a un autre banc sans avoir besoin de le recréer de 0."
        ]
      },
      "acceptanceCriteria": [
        "When called with valid target bench IDs, the component is appended to each target bench’s component list and persists after refresh.",
        "The duplicated component stored under each target bench has `associatedBenchId` equal to that target bench ID.",
        "A history entry is visible for each affected target bench indicating the duplication action.",
        "The method traps (fails) when a target bench does not exist or the caller is unauthorized."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a post-creation UI flow on the Bench Detail page to duplicate an existing component from the current bench to one or more other existing benches.\n\nUI/UX:\n- In the components table (Health Book) actions column, add an action to open a “Duplicate / Copy” flow for a specific component.\n- The flow must allow selecting one or multiple target benches from existing benches (excluding the current bench by default).\n- On confirm, duplicate the selected component to the selected benches using the backend duplication method.\n- Show success/error toasts and refresh component data for impacted benches.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Il faut aussi pouvoir le faire après sa création... en ajoutant un toggle \"copier ou dupliquer\" ..."
        ]
      },
      "acceptanceCriteria": [
        "From an existing bench’s components list, a user can select a component and duplicate it into at least one other bench via the UI.",
        "After duplication, the target bench’s components list includes the duplicated component (visible when navigating to the target bench).",
        "The current bench remains unchanged by default (copy behavior).",
        "React Query caches related to bench components are invalidated so the UI reflects changes without a hard reload."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a during-creation UI flow in the “Add New Test Bench” modal to allow extending (duplicating) a newly-created component to other existing benches.\n\nBehavior:\n- While adding a component in the Components (Health Book) section, provide a control to choose additional existing benches to also receive a copy of that component.\n- When the new bench is created, also duplicate the selected component(s) into the selected existing benches (after the new bench creation succeeds).\n- The copied components must have `associatedBenchId` set to the target bench IDs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "lors de la création d'un composants, j'aimerai avoir un bouton qui permet d'etendre ce même composants à d'autres bancq deja existants."
        ]
      },
      "acceptanceCriteria": [
        "In the Add Bench modal, the user can choose one or more existing benches to also receive a copy of a component being created.",
        "After submitting the Add Bench modal, the new bench is created as before, and the selected existing benches also contain the duplicated component(s).",
        "If duplication to other benches fails, the user sees a clear error toast indicating which operation failed, and the new bench creation result is not silently rolled back."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit any frontend files under frontend/src/components/ui or other immutablePaths listed in SYSTEM_CONTEXT; compose existing UI components instead.",
    "Do not introduce external databases or additional backend services."
  ],
  "nonGoals": [
    "Implementing a true ‘move’ (remove from source bench) workflow unless explicitly requested; this change focuses on copy/duplicate.",
    "Adding real-time synchronization across multiple users (no websockets).",
    "Changing the Component data model shape or introducing global component IDs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}