{
  "kind": "build_request",
  "title": "Fully translate Test Bench pages and default new users to English",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fully localize the entire Test Bench experience by replacing all hardcoded user-facing strings on Test Bench pages and their subcomponents with i18n translation keys, and ensure complete English and French translations exist for those keys.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1. Tous"
        ]
      },
      "acceptanceCriteria": [
        "All user-facing text on the Test Bench list page and Test Bench detail page is rendered via the i18n `t(...)` function (no hardcoded English/French strings remain in those pages).",
        "All user-facing text in Test Bench-related UI components used by those pages (e.g., create/edit bench modals, bench overview, history, documents, components editors, empty/loading/error states, button/label text) is rendered via the i18n `t(...)` function.",
        "`frontend/src/i18n/translations.ts` contains corresponding translation entries for both `en-US` and `fr-FR` for every key used by the Test Bench pages/components.",
        "Switching the language selector updates all Test Bench page text immediately without requiring a refresh."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Set English (en-US) as the default UI language for first-time users (i.e., users without an existing saved language preference) and keep persisting the user’s explicit language choice once selected.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "2. Oui"
        ]
      },
      "acceptanceCriteria": [
        "Frontend default language initialization uses `en-US` when no valid saved preference exists in localStorage and no backend preference exists.",
        "Backend `getLanguageTag()` returns `en-US` when the caller has no stored profile/language preference (instead of returning French).",
        "Backend `getCallerUserProfile()` default profile (when no profile exists yet) uses `languageTag = \"en-US\"`.",
        "After a signed-in user selects a different language, the preference is persisted and is used on subsequent visits/sessions (i.e., it no longer falls back to `en-US`)."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text introduced/updated as part of this change (translation values for `en-US`).",
    "Do not modify files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything in `frontend/src/components/ui` (compose them instead).",
    "Respect the single-actor Motoko backend architecture; keep language preference logic within `backend/main.mo`.",
    "Only add a state migration (`backend/migration.mo`) if a persisted state schema change is required (changing defaults alone should not require migration)."
  ],
  "nonGoals": [
    "Adding new languages beyond those already supported.",
    "Changing authentication (Internet Identity) behavior.",
    "Redesigning non-Test-Bench pages beyond what is necessary to keep i18n consistent."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}