{
  "kind": "build_request",
  "title": "Deploy approved Draft Version 36 to production",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Deploy the current approved build (Draft Version 36) to production as an Internet Computer canister upgrade, without making further feature/code changes.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "It is perfect, deploy it."
        ]
      },
      "acceptanceCriteria": [
        "A production deployment is performed using the current codebase corresponding to Draft Version 36.",
        "The canister upgrade completes successfully (no traps during preupgrade/postupgrade, if applicable).",
        "The production frontend loads and connects to the production backend canister successfully."
      ]
    },
    {
      "id": "REQ-2",
      "text": "After production deployment, perform a basic smoke test of the critical flows mentioned in the latest iteration: Internet Identity login/logout behavior and user profile persistence across refresh/relogin.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-3"
        ],
        "quotes": [
          "does the updated version feel closer to what you needed, especially around profile persistence and login behavior?",
          "It is perfect, deploy it."
        ]
      },
      "acceptanceCriteria": [
        "A user can sign in via Internet Identity and reach protected routes (e.g., Dashboard).",
        "A user can update their profile and the changes persist after a full page refresh.",
        "A user can log out and log back in and still see their persisted profile data.",
        "No new runtime errors are observed in the UI during the smoke test."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui or any other frontend immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implement new features or UI redesigns.",
    "Refactor backend/frontend architecture beyond what is required to deploy the already-approved build."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}