{
  "kind": "build_request",
  "title": "Make dashboard documents update instantly after bench-document changes",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Refactor the Dashboard page data loading to use React Query (instead of a one-time manual fetch) for the data powering the documents section, so the dashboard can be refreshed instantly via query invalidation when bench-document associations change.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "Dans le dashboard, j'ai constaté que les documents ne sont pas mis instantanément a jour par rapport a ce qui est rattaché pour chaque banc.",
          "Oui."
        ]
      },
      "acceptanceCriteria": [
        "DashboardPage no longer relies on local useState + useEffect to call actor.exportData() for documents/bench data; it uses a React Query hook with a stable queryKey.",
        "The dashboard documents list is sourced from the React Query cache and updates after a refetch without requiring a full page reload."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a dedicated React Query hook for dashboard/export data (e.g., wrapping actor.exportData() and any dependent calls like actor.getAllTestBenches()) and ensure it can be invalidated/refetched when documents are created, edited, deleted, or associated to benches.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "Normalement, ils doivent correspondre en temps réel.a ce qui correspond a un banc.",
          "Oui."
        ]
      },
      "acceptanceCriteria": [
        "A reusable hook exists in frontend/src/hooks/useQueries.ts (or a nearby non-immutable hook file) that fetches the dashboard/export payload and exposes loading/error state.",
        "The hook uses a single, well-defined queryKey (e.g., ['dashboardExportData'] or similar) so other mutations can invalidate it."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure all document/bench-document mutations invalidate the dashboard/export data query so the Dashboard documents section updates immediately after any of these actions within the app: upload+associate, associate existing document to a bench, remove document from a bench, edit bench document, duplicate bench document, and delete bench document.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "les documents ne sont pas mis instantanément a jour",
          "Oui."
        ]
      },
      "acceptanceCriteria": [
        "After uploading a document and associating it to a bench (BenchDocumentsEditor), navigating to (or already viewing) the Dashboard shows the correct updated assigned benches for that document without manual reload.",
        "After deleting, duplicating, or editing a bench document, the Dashboard documents list reflects the change after the mutation completes (no stale association list).",
        "React Query invalidation is implemented centrally in the relevant mutation hooks (e.g., useAssociateDocumentToBench, useRemoveDocumentFromBench, useEditBenchDocument, useDuplicateBenchDocument, useDeleteBenchDocument) by invalidating the dashboard/export queryKey in addition to existing per-bench invalidations."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update BenchDocumentsEditor to rely on React Query invalidation/refetch (not only local reload via calling actor.exportData()) so the bench documents view and the dashboard stay consistent, and avoid introducing any noticeable delay between an in-app document attachment change and the UI reflecting it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "ils doivent correspondre en temps réel",
          "Oui."
        ]
      },
      "acceptanceCriteria": [
        "BenchDocumentsEditor triggers refresh through React Query (either by using queryClient.invalidateQueries for the dashboard/export query and/or by consuming the shared query directly), rather than depending solely on re-calling actor.exportData() into local state.",
        "No additional user action (refresh button, page reload) is required for the dashboard’s document-to-bench mapping to become correct after performing document operations in the benches UI."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only shadcn components).",
    "Do not modify frontend immutable hook files listed in SYSTEM_CONTEXT (compose around them instead).",
    "Backend must remain a single Motoko actor; only add backend changes if strictly required for the refresh behavior."
  ],
  "nonGoals": [
    "Implementing true server push / WebSocket-style real-time updates.",
    "Changing the underlying document/bench data model in the backend.",
    "Adding new dashboard features beyond fixing the documents refresh behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}