{
  "kind": "build_request",
  "title": "Retry build: profile/entity/email rules, bench documents UX, global draggable layouts, admin entity users + online status, and UI fixes",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Profile: allow each user to set a custom profile photo (upload) OR choose from a predefined avatar list (e.g., duck, basketball, rocket, robot). Add an \"Entity\" field on the user profile to indicate the team (e.g., T2I).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Pour le profil, laisse la possibilité de mettre une photo de profil personnalisé ou bien d'en choisir une parmi une liste donnée, ex: photo de canard, ballon de basket, fusées, robot, etc.",
          "pour chaque profil, il faut rajouter un champ \"Entité\" permettant d'indiquer à quel équipe appartient. Par, exemple T2I."
        ]
      },
      "acceptanceCriteria": [
        "Profile page shows an avatar section with (1) upload control and (2) selectable predefined avatars.",
        "User can save either an uploaded photo or a predefined avatar selection and see it persist after reload.",
        "Profile data model includes an Entity string field; Profile page allows editing it and persists it.",
        "All new/updated user-facing UI text for this feature is in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Email domain rule: enforce the email domain '@safrangroup.com' when a user edits/saves their email in their own profile. In Admin settings, allow admins to change the enforced domain value (so it is configurable).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "pour le mail, force le nom de domaine à safrangroup.com dans le profil, par contre côté admin, laisse la possibilité de le changer dans les paramètres"
        ]
      },
      "acceptanceCriteria": [
        "When a non-admin user attempts to save a profile email that does not match the currently configured domain, the save is rejected with an English validation error message.",
        "Admin UI includes a setting to view and update the enforced email domain.",
        "Backend stores the enforced domain and applies it to profile email updates consistently.",
        "The default enforced domain is 'safrangroup.com' if no admin override has been set."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Bench documents UX: in each bench's Documents section, enable directly editing the HW/SW/Other document lists via a '+' add action. For every already-uploaded document, provide actions to delete (trash), edit/replace (pencil toggle), and download.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Quand on clique sur un banc, dans sa section documents, il faut pouvoir éditer directement la liste des documents HW/SW/Autres via un bouton + pour en ajouter.",
          "Mets en face de chaque documents déjà ujpload, un raccourci \"supprimer\" via une corbeille, un toggle de stylo pour éditer ou le changer, et un dernier pour le télécharger.",
          "Il faut faire ça pour tous les documents de chque banc."
        ]
      },
      "acceptanceCriteria": [
        "Bench detail Documents tab shows HW/SW/Other sections each with a visible '+' action to add a document.",
        "Each document row shows delete, edit/replace, and download actions and they work end-to-end.",
        "Replacing a document updates the stored file while keeping the document entry coherent (no duplicate/ghost entries after replace).",
        "All user-facing labels/tooltips for document actions are in English."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Make all layouts draggable/reorderable in all tabs using the same drag-and-drop behavior already used elsewhere, and unify/improve the drag-and-drop UX specifically from the Admin tab (consistent handles, spacing, and feedback).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9",
          "msg-11"
        ],
        "quotes": [
          "Rajoute la possibilité de déplacer tous les layouts dans tous les onglets pour améliorer l'expérience utilisateur.",
          "Pareil que ce qui a déjà été fait mais il faut aussi en profiter pour pnifier/améliorer l'UX depuis l'onglet Admin"
        ]
      },
      "acceptanceCriteria": [
        "All tabs that present layout blocks allow reordering via drag-and-drop (not only a subset).",
        "Drag interaction patterns are consistent across tabs (same handle/hover/active states).",
        "Admin tab layout reordering UX is visually consistent and clearer than before (handle visibility + drop indicator)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Admin: add an entity dropdown and filters that list all existing entities, allow the admin to select an entity, and display the users belonging to that selected entity.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-9",
          "msg-11"
        ],
        "quotes": [
          "Enfin, affiche dans Admin, la liste des users faisant partie de la même entité (ex: T2I ou IMI ou Qualité ou IVV ou Autres(s)...).",
          "B),",
          "toutes les entités existantes (liste déroulante, filtres, etc.)"
        ]
      },
      "acceptanceCriteria": [
        "Admin page includes an Entity selector listing all entities known to the system (not only those currently filtered/visible).",
        "Selecting an entity updates the displayed user list to only members of that entity.",
        "If an entity has no users, the UI shows an English empty state."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Admin: show an online status indicator next to each user in the entity user list (green dot when connected, red dot when disconnected). Implement online status without real-time sockets by tracking a backend last-seen timestamp updated by the frontend at a regular interval while the user is authenticated.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-11"
        ],
        "quotes": [
          "rajoute un point vert quand ils sont connectés et rouges quand ils sont déconnectés"
        ]
      },
      "acceptanceCriteria": [
        "Each listed user in Admin shows a green or red dot status indicator.",
        "Status determination is based on a stored last-seen timestamp and a defined threshold (e.g., within the last N minutes = online).",
        "Frontend updates last-seen periodically while the user remains signed in, and stops when signed out.",
        "No WebSockets or third-party real-time services are used."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Replace the current app logo with the provided Safran logo (resize as needed) and ensure it displays correctly in both light and dark themes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "project_state-1"
        ],
        "quotes": [
          "Replace current app logo with provided Safran logo (resize as needed)."
        ]
      },
      "acceptanceCriteria": [
        "The app header/navigation uses the Safran logo asset instead of the previous logo.",
        "Logo appears crisp at common header sizes and does not distort.",
        "Logo remains legible/appropriate in both light and dark mode."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Fix the light-mode header/top bar overlapping page content: keep the header fixed while scrolling with a white background and ensure the main content is correctly offset so it never renders underneath the header.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "project_state-1"
        ],
        "quotes": [
          "Fix light mode header/top bar overlapping page content; keep it fixed and with white background while scrolling."
        ]
      },
      "acceptanceCriteria": [
        "In light mode, the header remains fixed during scroll and has a white background.",
        "No page content is hidden behind the header in any primary route (Dashboard, Benches list/detail, Admin, Profile)."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add contextual shortcuts: show a \"Scroll to top\" button when the user reaches near the bottom of a page, and show a \"Scroll to bottom\" button when the user is near the top of a page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "project_state-1"
        ],
        "quotes": [
          "Add contextual shortcuts: show 'scroll to top' button when user reaches bottom, and 'scroll to bottom' when user reaches top."
        ]
      },
      "acceptanceCriteria": [
        "A scroll-to-bottom control appears when the user is near the top; clicking scrolls smoothly to the bottom.",
        "A scroll-to-top control appears when the user is near the bottom; clicking scrolls smoothly to the top.",
        "Controls do not obstruct important UI elements and are keyboard accessible."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Statistics: allow reordering of all internal layouts within Statistics (not just reordering the whole Statistics block).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "project_state-1"
        ],
        "quotes": [
          "Allow reordering of all internal layouts within Statistics (not just the whole block)."
        ]
      },
      "acceptanceCriteria": [
        "Within the Statistics area, individual chart/layout cards can be reordered via drag-and-drop.",
        "The order persists after refresh for the same user."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Statistics: add two separate charts with filters: (1) estimated number of components by criticality, and (2) estimated number of components by deadline/date limite. Both charts must be draggable as layouts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "project_state-1"
        ],
        "quotes": [
          "Add two separate Statistics charts with filters: estimate number of components by (1) criticality and (2) deadline/date limite; both charts must be draggable as layouts."
        ]
      },
      "acceptanceCriteria": [
        "Statistics page shows two distinct chart cards: by criticality and by deadline/date limite.",
        "Each chart includes filters that affect the displayed aggregation.",
        "Both chart cards participate in the internal Statistics drag-and-drop reorder system."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Benches list: show the PLM Agile URL shortcut under the bench image only if that URL field was provided at creation time; hide the shortcut when the field is empty/missing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "project_state-1"
        ],
        "quotes": [
          "In Benches list, show PLM Agile URL shortcut under the bench image only if the field was filled at creation (hide when empty)."
        ]
      },
      "acceptanceCriteria": [
        "Bench cards with an Agile URL show a visible shortcut link under the image.",
        "Bench cards without an Agile URL do not show any placeholder/link container."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Bench form: add a lightweight local/heuristic \"Rewrite\" button in the Description section that reformulates user text without calling external AI/LLM services.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "project_state-1"
        ],
        "quotes": [
          "Add a lightweight local/heuristic AI rewrite button in Bench form Description section to reformulate user text."
        ]
      },
      "acceptanceCriteria": [
        "Description field has a Rewrite button that updates the text using local heuristics only.",
        "The rewrite operation is deterministic and runs fully client-side.",
        "UI text (button label, helper text) is in English."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text added/changed by this build request.",
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Only use Internet Identity for authentication (no third-party auth).",
    "Do not use WebSockets or external real-time services for online status.",
    "Do not edit files under frontend/src/components/ui or any path listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "No third-party AI/LLM integration for the rewrite feature.",
    "No external database or non-Motoko backend services.",
    "No push notifications, email delivery integration, or chat/real-time messaging."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}