{
  "kind": "build_request",
  "title": "Ensure profile language selection instantly translates the entire UI after saving",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-3",
      "text": "When the user selects a language in the Profile page and clicks Save, apply that language immediately across the entire app UI (pages, sections, tabs, buttons, dialogs, placeholders, toasts, and footer) without requiring a reload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "Quand je sélectionne une langue et que je fais save dans le profil utilisateur, il faut que TOUT le site se traduise automatiquement ! Vraiment tout, e.g les pages, les sections, les onglets, les boutons.",
          "Oui."
        ]
      },
      "acceptanceCriteria": [
        "From the Profile page, selecting a different language and then clicking Save causes currently visible navigation labels, page titles, tabs, buttons, and helper texts to update to the new language immediately (no page reload).",
        "After saving, navigating to other pages (Dashboard, Benches, Admin, etc.) shows the new language consistently.",
        "Toast messages triggered immediately after Save display in the newly selected language."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Audit and replace any remaining hard-coded user-facing strings in the protected app shell and main pages with i18n translation keys so that a language change updates all visible UI text consistently.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "il faut que TOUT le site se traduise automatiquement ! Vraiment tout"
        ]
      },
      "acceptanceCriteria": [
        "No user-facing labels in the header navigation, footer, and the main pages (Dashboard, Benches, Bench Details, Profile, Admin) remain hard-coded in a single language if translation keys exist or can be added.",
        "Switching languages updates those texts without refresh."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Ensure the selected language is persisted to the backend user profile languageTag and correctly restored on sign-in so the app loads in the last saved language.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Quand je sélectionne une langue et que je fais save dans le profil utilisateur..."
        ]
      },
      "acceptanceCriteria": [
        "After setting a language and saving, signing out and signing back in loads the UI in that language.",
        "If the backend has no stored languageTag for the user, the app defaults to English (en-US) and remains functional."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text added in this change request (translation keys may map to other languages as needed).",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files in frontend/src/components/ui (compose instead of editing).",
    "Backend changes must respect the single-actor Motoko architecture (all logic in backend/main.mo); only add backend/migration.mo if a state migration is strictly required."
  ],
  "nonGoals": [
    "Fixing the intermittent deployment/build errors.",
    "Fixing the 'Backend Connection Error' issue unless it is directly caused by the language persistence changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}