{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Production release: Deploy Draft Version 36 (frontend-only plan)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Prepare the frontend release artifact and deployment notes for promoting Draft Version 36 to production without code changes.",
      "acceptanceCriteria": [
        "A production deployment is performed using the current codebase corresponding to Draft Version 36.",
        "The canister upgrade completes successfully (no traps during preupgrade/postupgrade, if applicable).",
        "The production frontend loads and connects to the production backend canister successfully."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT_PRODUCTION_DRAFT_V36.md",
          "operation": "create",
          "description": "Add a production deployment checklist focused on frontend release steps only (build, environment variable verification, canister IDs wiring expectations, and post-deploy verification that the SPA loads). Include a note that no feature/code changes are to be made for Draft Version 36; this file is documentation only."
        },
        {
          "path": "frontend/README_PRODUCTION_ENV.md",
          "operation": "create",
          "description": "Document the required production environment variables as consumed by the current frontend (e.g., II_* and CANISTER_* variables used by the existing configuration and Vite environment injection) and how to confirm they are correctly set during deployment."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a repeatable frontend smoke-test checklist for Internet Identity login/logout and user profile persistence across refresh/relogin.",
      "acceptanceCriteria": [
        "A user can sign in via Internet Identity and reach protected routes (e.g., Dashboard).",
        "A user can update their profile and the changes persist after a full page refresh.",
        "A user can log out and log back in and still see their persisted profile data.",
        "No new runtime errors are observed in the UI during the smoke test."
      ],
      "file_operations": [
        {
          "path": "frontend/SMOKE_TEST_PRODUCTION_DRAFT_V36.md",
          "operation": "create",
          "description": "Create a concise smoke-test script that explicitly validates: (1) Internet Identity sign-in from the Sign In page, (2) protected-route access via the AuthGate flow (e.g., Dashboard/Profile), (3) profile save and persistence after full refresh, (4) logout clears cached data and re-login still retrieves persisted profile. Reference the app’s existing authentication/profile flow (authorization component patterns via useInternetIdentity, useActor, and useGetCallerUserProfile). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}