{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix profile picture persistence/refresh and allow saving newly typed entity values",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Prevent profile saves from overwriting a newly updated profile picture and ensure avatar UI (including binôme profile) refreshes immediately after successful save.",
      "acceptanceCriteria": [
        "When a user selects a predefined avatar and clicks “Save Profile & Preferences”, the saved profile picture is the newly selected avatar (it must not revert to the previous avatar).",
        "When a user uploads a custom photo and clicks “Save Profile & Preferences”, the saved profile picture is the uploaded photo (it must not revert to the previous photo/avatar).",
        "After a successful save, any UI that displays the user’s avatar via public user info (e.g., the “binôme profile” tab) shows the updated avatar without requiring a hard refresh.",
        "React Query caches related to user profile/public user info are invalidated/refetched as needed so the update is visible immediately."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Fix save flow so the profile payload does not reuse/submit a stale profilePicture from the previously loaded profile. Build the new ProfilePicture from the current avatarMode (predefined) / uploaded custom photo and ensure the same new value is used consistently when saving (so a subsequent profile save cannot revert the picture). For custom uploads, use the existing upload helper hook (upload -> set) so the saved reference matches what the backend persists."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Tighten React Query invalidations for avatar updates: ensure mutations that update profile picture and/or profile invalidate/refetch caches used by avatar-rendering UI (including per-user public user info keys). Keep/confirm cache-buster refresh via useAvatarCacheBuster so custom image URLs update immediately."
        },
        {
          "path": "frontend/src/components/profile/UserAvatar.tsx",
          "operation": "modify",
          "description": "Ensure avatar rendering reliably reflects updates immediately after cache invalidation/buster changes (especially for custom blobs). Confirm the cache-busting strategy is applied consistently to prevent showing a stale cached custom image after a successful update."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Allow saving a newly typed Entity value (not only suggestions) and ensure newly saved entities appear in suggestions without a full reload.",
      "acceptanceCriteria": [
        "Typing a new entity value (e.g., “T2I”) and saving the profile persists that entity on the backend and is shown when reloading the profile.",
        "Entity saving works regardless of whether the value came from suggestions or was newly typed.",
        "After saving a profile with a new entity value, the entity suggestions list includes the newly saved value (without requiring a full page reload).",
        "The backend does not reject profile saving for admin users due to email-domain rules when the frontend indicates admins can use any domain."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/profile/EntityTagInput.tsx",
          "operation": "modify",
          "description": "Adjust the EntityTagInput UX so free-typed values are actually stored in the controlled value (not just in internal draft state). The user should be able to type a new entity (e.g., \"T2I\", \"IVV\", \"Qualite\", \"IMI\", \"RLI\") and click Save without needing an extra “Enter” action for it to persist."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Ensure the entity field sent on save always reflects what the user typed/selected. Keep admin email-domain bypass behavior intact (admins can use any domain) and ensure validation/messages remain English."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "After a successful profile save, invalidate/refetch the entity suggestion query (useGetUniqueEntities) so newly saved entity values appear in suggestions immediately without a full page reload."
        }
      ]
    }
  ]
}