{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Add Bench modal localization and add RU/ZH/JA/TR translations",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Localize the full Add Bench modal flow by replacing all user-facing strings in AddBenchModal with i18n translation lookups and adding missing translation keys.",
      "acceptanceCriteria": [
        "With a non-English language selected, opening the Add Bench modal shows translated UI for: title/description, all field labels, placeholders, helper texts, validation errors, button labels, loading/uploading text, and toast messages.",
        "The Add Bench modal contains no hardcoded English/French UI strings except for non-user-facing/internal values (e.g., IDs).",
        "If a translation key is missing for the active language, the UI does not crash (it may fall back to showing the key, consistent with the current i18n behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Benches/components/AddBenchModal.tsx",
          "operation": "modify",
          "description": "Import and use useI18n().t(...) for all user-facing strings in the modal (header/title/description, upload/progress labels, field labels/placeholders/help text, validation messages, duplication section copy, footer buttons, and all toast success/error messages), and remove remaining hardcoded UI strings while preserving internal/non-user-facing values."
        },
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Add any missing TranslationKey entries required by the Add Bench modal (including validation, helper copy, upload/progress and toast messages) and provide translations for existing languages so the modal is fully localized."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add RU/ZH/JA/TR as supported UI languages and provide complete translation dictionaries for all TranslationKey entries.",
      "acceptanceCriteria": [
        "The language selector (Profile page) shows the newly supported languages and allows selecting them without warnings about unsupported languages.",
        "For each new language tag, translations[tag] exists and contains values for all TranslationKey entries used by the app (including new Add Bench keys), so the UI does not display raw keys for common screens (Dashboard, Benches list, Bench details, Profile, Admin).",
        "User language choice continues to persist via existing actor.setLanguageTag / actor.getLanguageTag behavior (no backend changes required)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/i18n/languages.ts",
          "operation": "modify",
          "description": "Extend SUPPORTED_LANGUAGES with Russian, Simplified Chinese, Japanese, and Turkish entries (language tags and display names) so they appear in the Profile language selector and pass supported-language validation."
        },
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Add complete translation dictionaries for the new language tags (e.g., ru-RU, zh-CN, ja-JP, tr-TR) ensuring every TranslationKey has a value (including any new Add Bench keys) to avoid raw-key display on common screens."
        }
      ]
    }
  ]
}