{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Instant app-wide i18n refresh after Profile language Save",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Apply the newly saved Profile language immediately across the entire protected UI (including toasts) without reload.",
      "acceptanceCriteria": [
        "From the Profile page, selecting a different language and then clicking Save causes currently visible navigation labels, page titles, tabs, buttons, and helper texts to update to the new language immediately (no page reload).",
        "After saving, navigating to other pages (Dashboard, Benches, Admin, etc.) shows the new language consistently.",
        "Toast messages triggered immediately after Save display in the newly selected language."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Change the language selection flow to stage the selected language locally and only apply it via i18n (useI18n().setLanguageTag) after the user clicks Save and the save succeeds; ensure the success toast after Save is emitted after the language is applied so it renders in the new language."
        },
        {
          "path": "frontend/src/i18n/I18nProvider.tsx",
          "operation": "modify",
          "description": "Ensure language changes propagate immediately to all consumers by keeping the provider state as the single source of truth for the active language and by avoiding initialization logic that overwrites a freshly applied language after a save completes."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Ensure all app shell visible strings (navigation and footer) are derived from translation keys via useI18n().t so they re-render immediately when the active language changes."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Replace remaining hard-coded user-facing strings in the protected shell and main pages with i18n translation keys to ensure full UI updates on language change.",
      "acceptanceCriteria": [
        "No user-facing labels in the header navigation, footer, and the main pages (Dashboard, Benches, Bench Details, Profile, Admin) remain hard-coded in a single language if translation keys exist or can be added.",
        "Switching languages updates those texts without refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Replace remaining hard-coded footer text with translation keys (e.g., footer.builtWith/footer.using) so the footer updates immediately on language changes."
        },
        {
          "path": "frontend/src/pages/SignInPage.tsx",
          "operation": "modify",
          "description": "Replace hard-coded sign-in page descriptions and helper text with i18n translation keys (use useI18n().t) so the sign-in UI is consistent with selected language."
        },
        {
          "path": "frontend/src/components/admin/AdminGate.tsx",
          "operation": "modify",
          "description": "Replace hard-coded permission-checking and access denied strings with i18n translation keys so protected admin gating UI updates immediately when language changes."
        },
        {
          "path": "frontend/src/components/AppErrorBoundary.tsx",
          "operation": "modify",
          "description": "Replace hard-coded error boundary title/body/button text with i18n translation keys so error UI is language-aware and updates consistently."
        },
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Add any missing translation keys (English text for newly introduced user-facing strings, plus corresponding French translations where applicable) used by AppShell footer, SignInPage helper texts, AdminGate, and AppErrorBoundary."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Restore and persist the user’s selected language via the backend-backed user profile languageTag so the app loads in the last saved language on sign-in (with en-US default).",
      "acceptanceCriteria": [
        "After setting a language and saving, signing out and signing back in loads the UI in that language.",
        "If the backend has no stored languageTag for the user, the app defaults to English (en-US) and remains functional."
      ],
      "file_operations": [
        {
          "path": "frontend/src/i18n/I18nProvider.tsx",
          "operation": "modify",
          "description": "On authenticated initialization, restore language from the backend-backed user profile languageTag (fall back to localStorage and then en-US) and keep localStorage in sync; ensure unsupported/missing tags resolve to en-US."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Ensure Save persists the selected languageTag into the saved user profile data and only then applies it via I18nProvider (so the restored language on next sign-in matches the last saved value)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust relevant React Query invalidations/refresh patterns (where needed) so that after saving the profile languageTag, subsequent reads used by i18n restoration reflect the updated saved value without requiring a full reload."
        }
      ]
    }
  ]
}