{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Publish Draft Version 51 to Production (Frontend-only docs & runbooks)",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Document and follow the production deployment checklist steps for promoting Draft Version 51 to IC mainnet, including production env var verification and frontend asset publish order constraints.",
      "acceptanceCriteria": [
        "Production deployment is executed against `DFX_NETWORK=ic`.",
        "Production environment variables are verified before deployment, including `CANISTER_ID_BACKEND`, `CANISTER_ID_FRONTEND`, and `II_URL=https://identity.ic0.app` (per `frontend/README_PRODUCTION_ENV.md`).",
        "Frontend assets are published to the production frontend canister and load successfully at `https://<CANISTER_ID_FRONTEND>.ic0.app`.",
        "Backend canister is confirmed healthy before publishing the frontend (e.g., status/cycles and a basic query call succeeds)."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT_PRODUCTION_DRAFT_V51.md",
          "operation": "create",
          "description": "Create a Draft Version 51 production deployment checklist by adapting the existing Draft V47/V48 checklists: include explicit verification of `DFX_NETWORK=ic`, required env vars (`CANISTER_ID_BACKEND`, `CANISTER_ID_FRONTEND`, `II_URL=https://identity.ic0.app` per `frontend/README_PRODUCTION_ENV.md`), and the required order of operations (confirm backend health before publishing frontend assets). Ensure the checklist remains promotion-only (no code/product changes)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update the production smoke test runbook for Draft Version 51 and record production smoke test results in the existing V48 results template after publishing.",
      "acceptanceCriteria": [
        "Smoke tests are executed on the production URL after publishing (using the steps in `frontend/SMOKE_TEST_PRODUCTION_DRAFT_V48.md` as the baseline procedure).",
        "Results are recorded in `frontend/SMOKE_TEST_PRODUCTION_RESULTS_V48.md`, including PASS/FAIL for each section and diagnostics for any failures.",
        "If any critical issues are encountered (app fails to load, cannot sign in, data loss, security issue, or backend out-of-cycles/traps), publishing is treated as failed and the issue is documented in the results file."
      ],
      "file_operations": [
        {
          "path": "frontend/SMOKE_TEST_PRODUCTION_DRAFT_V51.md",
          "operation": "create",
          "description": "Create a Draft Version 51 production smoke test procedure by baselining from `frontend/SMOKE_TEST_PRODUCTION_DRAFT_V48.md` and updating version references and any Draft V51-specific notes, while keeping the same test scope (authentication, profile setup/persistence, sign-out/re-auth, language preferences, dashboard, benches/components) and diagnostics requirements."
        },
        {
          "path": "frontend/SMOKE_TEST_PRODUCTION_RESULTS_V48.md",
          "operation": "modify",
          "description": "Update the existing smoke test results template to explicitly support recording a Draft Version 51 production run (e.g., clarify that the file is used for the V51 publish, update the version field guidance, and ensure there is space to record PASS/FAIL per section plus required diagnostics and critical-issue handling notes), while preserving the template structure used by the V48 baseline procedure."
        }
      ]
    }
  ]
}