{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Protected user profile details view and avatar-to-profile navigation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a protected user profile details page routed by principal ID that displays public profile info (username, entity, bio, large profile picture) with loading and not-found states, without edit capabilities.",
      "acceptanceCriteria": [
        "A new protected route exists for viewing a user's public profile by principal ID (e.g., /users/$userId).",
        "The page shows: username, entity, bio, and a larger version of the user's profile picture.",
        "The page has clear English UI text for headings/labels and handles loading and \"user not found\" states gracefully.",
        "The page does not allow editing another user's data."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Users/UserProfileDetailsPage.tsx",
          "operation": "create",
          "description": "Create the \"User Profile Details\" protected page that reads the route param (principal text), fetches public user info via the existing React Query hook, and renders username/entity/bio plus a large profile picture. Use the existing AuthGate/ActorGate protected layout (authorization component) implicitly via protected routing; use the existing UserAvatar component for consistent profile picture rendering (including blob-storage ExternalBlob direct URL handling for custom images). Include graceful UI for loading, invalid principal, and \"User not found\". Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new protected route at /users/$userId that renders the new UserProfileDetailsPage within the existing protected route tree (ensuring it is behind AuthGate/ActorGate). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make avatars clickable (at minimum in Bench History) so clicking navigates to the profile details route for that user's principal ID without changing avatar styling/layout.",
      "acceptanceCriteria": [
        "In the bench history UI, clicking a user's avatar opens that user's profile details view.",
        "Navigation uses the clicked history entry's user principal ID.",
        "The avatar remains visually consistent with existing styling (no layout break)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Benches/components/BenchHistoryList.tsx",
          "operation": "modify",
          "description": "Wrap the rendered UserAvatar (and optionally the username text) for each history entry in a router Link to /users/$userId using entry.user.toString() as the route param, while preserving existing size/className so layout remains unchanged. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update the frontend data layer and types to consume the expanded PublicUserInfo fields and use them in bench history and the new profile details view without breaking existing call sites.",
      "acceptanceCriteria": [
        "The React Query hook used to fetch public user info supports the expanded fields and does not break existing call sites.",
        "Bench history continues to render usernames/avatars as before, and can optionally show additional info only where designed, without errors.",
        "TypeScript types compile cleanly after candid/type updates."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure useGetPublicUserInfo continues to return the expanded PublicUserInfo shape (username, bio, entity, profilePicture) and remains backward-compatible for existing callers (e.g., bench history). Add any small helper(s) needed for route-param usage (e.g., principal parsing) without changing existing hook signatures. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Align frontend TypeScript declarations with the expanded PublicUserInfo type (username, bio, entity, profilePicture) as consumed by the UI and hooks, ensuring the actor method typing for getPublicUserInfo remains consistent so TypeScript compiles cleanly."
        }
      ]
    }
  ]
}