{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-06T10:08:30.965Z",
  "summary": "Diff adds a frontend duplication dialog and wires duplication-related hooks into Bench Detail and Add Bench modal, but the backend duplication method behavior and several acceptance-criteria details are not verifiable from the provided truncated diff summary.",
  "missing_requirements": [
    {
      "id": "REQ-1",
      "requirement": "Add backend support (single Motoko actor) to duplicate a Component into one or more target benches with bench-existence validation, authorization checks, per-bench history entries, associatedBenchId rewritten per target, and trapping on unauthorized/missing bench.",
      "reason": "backend/main.mo is truncated and does not show any new shared duplication method, nor evidence of bench existence validation, history writes, or trap behavior for invalid benches/unauthorized callers.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-2",
      "requirement": "Invalidate/refresh React Query caches related to bench components so UI reflects duplication without a hard reload (and refresh impacted benches’ component data).",
      "reason": "DuplicateComponentDialog triggers a mutation and closes with a toast, but the diff summary does not include the implementation of useDuplicateComponentToBenches (or explicit invalidations) showing that bench component queries are invalidated/refetched.",
      "evidence": [
        "frontend/src/pages/Benches/components/DuplicateComponentDialog.tsx",
        "frontend/src/hooks/useQueries.ts (truncated)"
      ]
    },
    {
      "id": "REQ-3",
      "requirement": "During Add New Test Bench creation, allow choosing additional existing benches to receive copies of the component(s) being created; after bench creation succeeds, duplicate the selected component(s) into selected benches; show clear error toast if duplication fails without rolling back creation.",
      "reason": "AddBenchModal introduces selectedBenchesForDuplication state and uses useDuplicateComponentToBenches, but the truncated diff does not show (a) UI that maps duplication targets to specific newly-created component(s), (b) the post-create sequencing that duplicates components after createBench succeeds, or (c) the required error handling behavior when duplication fails.",
      "evidence": [
        "frontend/src/pages/Benches/components/AddBenchModal.tsx (truncated)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "“Rewrite description” functionality in Add Bench modal (rewriteDescription + Sparkles icon + toast).",
      "reason": "Not requested in the BuildRequest; appears as newly added behavior in the modified AddBenchModal.",
      "evidence": [
        "frontend/src/pages/Benches/components/AddBenchModal.tsx (truncated)"
      ]
    }
  ],
  "confidence": 0.58,
  "changed_files": [
    "backend/main.mo",
    "frontend-file-summaries.txt",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/pages/Benches/BenchDetailPage.tsx",
    "frontend/src/pages/Benches/components/AddBenchModal.tsx",
    "frontend/src/pages/Benches/components/BenchComponentsTableEditor.tsx",
    "frontend/src/pages/Benches/components/DuplicateComponentDialog.tsx",
    "project_state.json"
  ]
}